summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO127_DATAH.
* To use register names with standard convension, please use CAN_MO127_DATAH.
*/
#define	CAN_MODATAH127	(CAN_MO127_DATAH)

/** \\brief  1FF0, Message Object  Data Register Low */
#define CAN_MO127_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019FF0u)

/** Alias (User Manual Name) for CAN_MO127_DATAL.
* To use register names with standard convension, please use CAN_MO127_DATAL.
*/
#define	CAN_MODATAL127	(CAN_MO127_DATAL)

/** \\brief  1FE0, Message Object  Function Control Register */
#define CAN_MO127_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019FE0u)

/** Alias (User Manual Name) for CAN_MO127_FCR.
* To use register names with standard convension, please use CAN_MO127_FCR.
*/
#define	CAN_MOFCR127	(CAN_MO127_FCR)

/** \\brief  1FE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO127_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019FE4u)

/** Alias (User Manual Name) for CAN_MO127_FGPR.
* To use register names with standard convension, please use CAN_MO127_FGPR.
*/
#define	CAN_MOFGPR127	(CAN_MO127_FGPR)

/** \\brief  1FE8, Message Object  Interrupt Pointer Register */
#define CAN_MO127_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019FE8u)

/** Alias (User Manual Name) for CAN_MO127_IPR.
* To use register names with standard convension, please use CAN_MO127_IPR.
*/
#define	CAN_MOIPR127	(CAN_MO127_IPR)

/** \\brief  200C, Message Object  Acceptance Mask Register */
#define CAN_MO128_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A00Cu)

/** Alias (User Manual Name) for CAN_MO128_AMR.
* To use register names with standard convension, please use CAN_MO128_AMR.
*/
#define	CAN_MOAMR128	(CAN_MO128_AMR)

/** \\brief  2018, Message Object  Arbitration Register */
#define CAN_MO128_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A018u)

/** Alias (User Manual Name) for CAN_MO128_AR.
* To use register names with standard convension, please use CAN_MO128_AR.
*/
#define	CAN_MOAR128	(CAN_MO128_AR)

/** \\brief  201C, Message Object  Control Register */
#define CAN_MO128_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A01Cu)

/** Alias (User Manual Name) for CAN_MO128_CTR_STAT.
* To use register names with standard convension, please use CAN_MO128_CTR_STAT.
*/
#define	CAN_MOSTAT128	(CAN_MO128_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO128_CTR_STAT.
* To use register names with standard convension, please use CAN_MO128_CTR_STAT.
*/
#define	CAN_MOCTR128	(CAN_MO128_CTR_STAT)

/** \\brief  2014, Message Object  Data Register High */
#define CAN_MO128_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A014u)

/** Alias (User Manual Name) for CAN_MO128_DATAH.
* To use register names with standard convension, please use CAN_MO128_DATAH.
*/
#define	CAN_MODATAH128	(CAN_MO128_DATAH)

/** \\brief  2010, Message Object  Data Register Low */
#define CAN_MO128_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A010u)

/** Alias (User Manual Name) for CAN_MO128_DATAL.
* To use register names with standard convension, please use CAN_MO128_DATAL.
*/
#define	CAN_MODATAL128	(CAN_MO128_DATAL)

/** \\brief  2000, Message Object  Function Control Register */
#define CAN_MO128_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A000u)

/** Alias (User Manual Name) for CAN_MO128_FCR.
* To use register names with standard convension, please use CAN_MO128_FCR.
*/
#define	CAN_MOFCR128	(CAN_MO128_FCR)

/** \\brief  2004, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO128_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A004u)

/** Alias (User Manual Name) for CAN_MO128_FGPR.
* To use register names with standard convension, please use CAN_MO128_FGPR.
*/
#define	CAN_MOFGPR128	(CAN_MO128_FGPR)

/** \\brief  2008, Message Object  Interrupt Pointer Register */
#define CAN_MO128_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A008u)

/** Alias (User Manual Name) for CAN_MO128_IPR.
* To use register names with standard convension, please use CAN_MO128_IPR.
*/
#define	CAN_MOIPR128	(CAN_MO128_IPR)

/** \\brief  202C, Message Object  Acceptance Mask Register */
#define CAN_MO129_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A02Cu)

/** Alias (User Manual Name) for CAN_MO129_AMR.
* To use register names with standard convension, please use CAN_MO129_AMR.
*/
#define	CAN_MOAMR129	(CAN_MO129_AMR)

/** \\brief  2038, Message Object  Arbitration Register */
#define CAN_MO129_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A038u)

/** Alias (User Manual Name) for CAN_MO129_AR.
* To use register names with standard convension, please use CAN_MO129_AR.
*/
#define	CAN_MOAR129	(CAN_MO129_AR)

/** \\brief  203C, Message Object  Control Register */
#define CAN_MO129_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A03Cu)

/** Alias (User Manual Name) for CAN_MO129_CTR_STAT.
* To use register names with standard convension, please use CAN_MO129_CTR_STAT.
*/
#define	CAN_MOSTAT129	(CAN_MO129_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO129_CTR_STAT.
* To use register names with standard convension, please use CAN_MO129_CTR_STAT.
*/
#define	CAN_MOCTR129	(CAN_MO129_CTR_STAT)

/** \\brief  2034, Message Object  Data Register High */
#define CAN_MO129_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A034u)

/** Alias (User Manual Name) for CAN_MO129_DATAH.
* To use register names with standard convension, please use CAN_MO129_DATAH.
*/
#define	CAN_MODATAH129	(CAN_MO129_DATAH)

/** \\brief  2030, Message Object  Data Register Low */
#define CAN_MO129_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A030u)

/** Alias (User Manual Name) for CAN_MO129_DATAL.
* To use register names with standard convension, please use CAN_MO129_DATAL.
*/
#define	CAN_MODATAL129	(CAN_MO129_DATAL)

/** \\brief  2020, Message Object  Function Control Register */
#define CAN_MO129_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A020u)

/** Alias (User Manual Name) for CAN_MO129_FCR.
* To use register names with standard convension, please use CAN_MO129_FCR.
*/
#define	CAN_MOFCR129	(CAN_MO129_FCR)

/** \\brief  2024, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO129_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A024u)

/** Alias (User Manual Name) for CAN_MO129_FGPR.
* To use register names with standard convension, please use CAN_MO129_FGPR.
*/
#define	CAN_MOFGPR129	(CAN_MO129_FGPR)

/** \\brief  2028, Message Object  Interrupt Pointer Register */
#define CAN_MO129_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A028u)

/** Alias (User Manual Name) for CAN_MO129_IPR.
* To use register names with standard convension, please use CAN_MO129_IPR.
*/
#define	CAN_MOIPR129	(CAN_MO129_IPR)

