summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_reg.h
/** \\brief  118C, Message Object  Acceptance Mask Register */
#define CAN_MO12_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001918Cu)

/** Alias (User Manual Name) for CAN_MO12_AMR.
* To use register names with standard convension, please use CAN_MO12_AMR.
*/
#define	CAN_MOAMR12	(CAN_MO12_AMR)

/** \\brief  1198, Message Object  Arbitration Register */
#define CAN_MO12_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019198u)

/** Alias (User Manual Name) for CAN_MO12_AR.
* To use register names with standard convension, please use CAN_MO12_AR.
*/
#define	CAN_MOAR12	(CAN_MO12_AR)

/** \\brief  119C, Message Object  Control Register */
#define CAN_MO12_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001919Cu)

/** Alias (User Manual Name) for CAN_MO12_CTR_STAT.
* To use register names with standard convension, please use CAN_MO12_CTR_STAT.
*/
#define	CAN_MOSTAT12	(CAN_MO12_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO12_CTR_STAT.
* To use register names with standard convension, please use CAN_MO12_CTR_STAT.
*/
#define	CAN_MOCTR12	(CAN_MO12_CTR_STAT)

/** \\brief  1194, Message Object  Data Register High */
#define CAN_MO12_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019194u)

/** Alias (User Manual Name) for CAN_MO12_DATAH.
* To use register names with standard convension, please use CAN_MO12_DATAH.
*/
#define	CAN_MODATAH12	(CAN_MO12_DATAH)

/** \\brief  1190, Message Object  Data Register Low */
#define CAN_MO12_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019190u)

/** Alias (User Manual Name) for CAN_MO12_DATAL.
* To use register names with standard convension, please use CAN_MO12_DATAL.
*/
#define	CAN_MODATAL12	(CAN_MO12_DATAL)

/** \\brief  1180, Message Object  Function Control Register */
#define CAN_MO12_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019180u)

/** Alias (User Manual Name) for CAN_MO12_FCR.
* To use register names with standard convension, please use CAN_MO12_FCR.
*/
#define	CAN_MOFCR12	(CAN_MO12_FCR)

/** \\brief  1184, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO12_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019184u)

/** Alias (User Manual Name) for CAN_MO12_FGPR.
* To use register names with standard convension, please use CAN_MO12_FGPR.
*/
#define	CAN_MOFGPR12	(CAN_MO12_FGPR)

/** \\brief  1188, Message Object  Interrupt Pointer Register */
#define CAN_MO12_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019188u)

/** Alias (User Manual Name) for CAN_MO12_IPR.
* To use register names with standard convension, please use CAN_MO12_IPR.
*/
#define	CAN_MOIPR12	(CAN_MO12_IPR)

/** \\brief  204C, Message Object  Acceptance Mask Register */
#define CAN_MO130_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A04Cu)

/** Alias (User Manual Name) for CAN_MO130_AMR.
* To use register names with standard convension, please use CAN_MO130_AMR.
*/
#define	CAN_MOAMR130	(CAN_MO130_AMR)

/** \\brief  2058, Message Object  Arbitration Register */
#define CAN_MO130_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A058u)

/** Alias (User Manual Name) for CAN_MO130_AR.
* To use register names with standard convension, please use CAN_MO130_AR.
*/
#define	CAN_MOAR130	(CAN_MO130_AR)

/** \\brief  205C, Message Object  Control Register */
#define CAN_MO130_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A05Cu)

/** Alias (User Manual Name) for CAN_MO130_CTR_STAT.
* To use register names with standard convension, please use CAN_MO130_CTR_STAT.
*/
#define	CAN_MOCTR130	(CAN_MO130_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO130_CTR_STAT.
* To use register names with standard convension, please use CAN_MO130_CTR_STAT.
*/
#define	CAN_MOSTAT130	(CAN_MO130_CTR_STAT)

/** \\brief  2054, Message Object  Data Register High */
#define CAN_MO130_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A054u)

/** Alias (User Manual Name) for CAN_MO130_DATAH.
* To use register names with standard convension, please use CAN_MO130_DATAH.
*/
#define	CAN_MODATAH130	(CAN_MO130_DATAH)

/** \\brief  2050, Message Object  Data Register Low */
#define CAN_MO130_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A050u)

/** Alias (User Manual Name) for CAN_MO130_DATAL.
* To use register names with standard convension, please use CAN_MO130_DATAL.
*/
#define	CAN_MODATAL130	(CAN_MO130_DATAL)

/** \\brief  2040, Message Object  Function Control Register */
#define CAN_MO130_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A040u)

/** Alias (User Manual Name) for CAN_MO130_FCR.
* To use register names with standard convension, please use CAN_MO130_FCR.
*/
#define	CAN_MOFCR130	(CAN_MO130_FCR)

/** \\brief  2044, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO130_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A044u)

/** Alias (User Manual Name) for CAN_MO130_FGPR.
* To use register names with standard convension, please use CAN_MO130_FGPR.
*/
#define	CAN_MOFGPR130	(CAN_MO130_FGPR)

/** \\brief  2048, Message Object  Interrupt Pointer Register */
#define CAN_MO130_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A048u)

/** Alias (User Manual Name) for CAN_MO130_IPR.
* To use register names with standard convension, please use CAN_MO130_IPR.
*/
#define	CAN_MOIPR130	(CAN_MO130_IPR)

/** \\brief  206C, Message Object  Acceptance Mask Register */
#define CAN_MO131_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A06Cu)

/** Alias (User Manual Name) for CAN_MO131_AMR.
* To use register names with standard convension, please use CAN_MO131_AMR.
*/
#define	CAN_MOAMR131	(CAN_MO131_AMR)

/** \\brief  2078, Message Object  Arbitration Register */
#define CAN_MO131_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A078u)

/** Alias (User Manual Name) for CAN_MO131_AR.
* To use register names with standard convension, please use CAN_MO131_AR.
*/
#define	CAN_MOAR131	(CAN_MO131_AR)

/** \\brief  207C, Message Object  Control Register */
#define CAN_MO131_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A07Cu)

/** Alias (User Manual Name) for CAN_MO131_CTR_STAT.
* To use register names with standard convension, please use CAN_MO131_CTR_STAT.
*/
#define	CAN_MOCTR131	(CAN_MO131_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO131_CTR_STAT.
* To use register names with standard convension, please use CAN_MO131_CTR_STAT.
*/
#define	CAN_MOSTAT131	(CAN_MO131_CTR_STAT)

/** \\brief  2074, Message Object  Data Register High */
#define CAN_MO131_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A074u)

