summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO133_IPR.
* To use register names with standard convension, please use CAN_MO133_IPR.
*/
#define	CAN_MOIPR133	(CAN_MO133_IPR)

/** \\brief  20CC, Message Object  Acceptance Mask Register */
#define CAN_MO134_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A0CCu)

/** Alias (User Manual Name) for CAN_MO134_AMR.
* To use register names with standard convension, please use CAN_MO134_AMR.
*/
#define	CAN_MOAMR134	(CAN_MO134_AMR)

/** \\brief  20D8, Message Object  Arbitration Register */
#define CAN_MO134_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A0D8u)

/** Alias (User Manual Name) for CAN_MO134_AR.
* To use register names with standard convension, please use CAN_MO134_AR.
*/
#define	CAN_MOAR134	(CAN_MO134_AR)

/** \\brief  20DC, Message Object  Control Register */
#define CAN_MO134_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A0DCu)

/** Alias (User Manual Name) for CAN_MO134_CTR_STAT.
* To use register names with standard convension, please use CAN_MO134_CTR_STAT.
*/
#define	CAN_MOCTR134	(CAN_MO134_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO134_CTR_STAT.
* To use register names with standard convension, please use CAN_MO134_CTR_STAT.
*/
#define	CAN_MOSTAT134	(CAN_MO134_CTR_STAT)

/** \\brief  20D4, Message Object  Data Register High */
#define CAN_MO134_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A0D4u)

/** Alias (User Manual Name) for CAN_MO134_DATAH.
* To use register names with standard convension, please use CAN_MO134_DATAH.
*/
#define	CAN_MODATAH134	(CAN_MO134_DATAH)

/** \\brief  20D0, Message Object  Data Register Low */
#define CAN_MO134_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A0D0u)

/** Alias (User Manual Name) for CAN_MO134_DATAL.
* To use register names with standard convension, please use CAN_MO134_DATAL.
*/
#define	CAN_MODATAL134	(CAN_MO134_DATAL)

/** \\brief  20C0, Message Object  Function Control Register */
#define CAN_MO134_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A0C0u)

/** Alias (User Manual Name) for CAN_MO134_FCR.
* To use register names with standard convension, please use CAN_MO134_FCR.
*/
#define	CAN_MOFCR134	(CAN_MO134_FCR)

/** \\brief  20C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO134_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A0C4u)

/** Alias (User Manual Name) for CAN_MO134_FGPR.
* To use register names with standard convension, please use CAN_MO134_FGPR.
*/
#define	CAN_MOFGPR134	(CAN_MO134_FGPR)

/** \\brief  20C8, Message Object  Interrupt Pointer Register */
#define CAN_MO134_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A0C8u)

/** Alias (User Manual Name) for CAN_MO134_IPR.
* To use register names with standard convension, please use CAN_MO134_IPR.
*/
#define	CAN_MOIPR134	(CAN_MO134_IPR)

/** \\brief  20EC, Message Object  Acceptance Mask Register */
#define CAN_MO135_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A0ECu)

/** Alias (User Manual Name) for CAN_MO135_AMR.
* To use register names with standard convension, please use CAN_MO135_AMR.
*/
#define	CAN_MOAMR135	(CAN_MO135_AMR)

/** \\brief  20F8, Message Object  Arbitration Register */
#define CAN_MO135_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A0F8u)

/** Alias (User Manual Name) for CAN_MO135_AR.
* To use register names with standard convension, please use CAN_MO135_AR.
*/
#define	CAN_MOAR135	(CAN_MO135_AR)

/** \\brief  20FC, Message Object  Control Register */
#define CAN_MO135_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A0FCu)

/** Alias (User Manual Name) for CAN_MO135_CTR_STAT.
* To use register names with standard convension, please use CAN_MO135_CTR_STAT.
*/
#define	CAN_MOCTR135	(CAN_MO135_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO135_CTR_STAT.
* To use register names with standard convension, please use CAN_MO135_CTR_STAT.
*/
#define	CAN_MOSTAT135	(CAN_MO135_CTR_STAT)

/** \\brief  20F4, Message Object  Data Register High */
#define CAN_MO135_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A0F4u)

/** Alias (User Manual Name) for CAN_MO135_DATAH.
* To use register names with standard convension, please use CAN_MO135_DATAH.
*/
#define	CAN_MODATAH135	(CAN_MO135_DATAH)

/** \\brief  20F0, Message Object  Data Register Low */
#define CAN_MO135_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A0F0u)

/** Alias (User Manual Name) for CAN_MO135_DATAL.
* To use register names with standard convension, please use CAN_MO135_DATAL.
*/
#define	CAN_MODATAL135	(CAN_MO135_DATAL)

/** \\brief  20E0, Message Object  Function Control Register */
#define CAN_MO135_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A0E0u)

/** Alias (User Manual Name) for CAN_MO135_FCR.
* To use register names with standard convension, please use CAN_MO135_FCR.
*/
#define	CAN_MOFCR135	(CAN_MO135_FCR)

/** \\brief  20E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO135_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A0E4u)

/** Alias (User Manual Name) for CAN_MO135_FGPR.
* To use register names with standard convension, please use CAN_MO135_FGPR.
*/
#define	CAN_MOFGPR135	(CAN_MO135_FGPR)

/** \\brief  20E8, Message Object  Interrupt Pointer Register */
#define CAN_MO135_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A0E8u)

/** Alias (User Manual Name) for CAN_MO135_IPR.
* To use register names with standard convension, please use CAN_MO135_IPR.
*/
#define	CAN_MOIPR135	(CAN_MO135_IPR)

/** \\brief  210C, Message Object  Acceptance Mask Register */
#define CAN_MO136_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A10Cu)

/** Alias (User Manual Name) for CAN_MO136_AMR.
* To use register names with standard convension, please use CAN_MO136_AMR.
*/
#define	CAN_MOAMR136	(CAN_MO136_AMR)

/** \\brief  2118, Message Object  Arbitration Register */
#define CAN_MO136_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A118u)

/** Alias (User Manual Name) for CAN_MO136_AR.
* To use register names with standard convension, please use CAN_MO136_AR.
*/
#define	CAN_MOAR136	(CAN_MO136_AR)

/** \\brief  211C, Message Object  Control Register */
#define CAN_MO136_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A11Cu)

/** Alias (User Manual Name) for CAN_MO136_CTR_STAT.
* To use register names with standard convension, please use CAN_MO136_CTR_STAT.
*/
#define	CAN_MOCTR136	(CAN_MO136_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO136_CTR_STAT.
* To use register names with standard convension, please use CAN_MO136_CTR_STAT.
*/
#define	CAN_MOSTAT136	(CAN_MO136_CTR_STAT)

/** \\brief  2114, Message Object  Data Register High */
#define CAN_MO136_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A114u)

/** Alias (User Manual Name) for CAN_MO136_DATAH.
* To use register names with standard convension, please use CAN_MO136_DATAH.
*/
#define	CAN_MODATAH136	(CAN_MO136_DATAH)

/** \\brief  2110, Message Object  Data Register Low */
#define CAN_MO136_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A110u)

/** Alias (User Manual Name) for CAN_MO136_DATAL.
* To use register names with standard convension, please use CAN_MO136_DATAL.
*/
#define	CAN_MODATAL136	(CAN_MO136_DATAL)

/** \\brief  2100, Message Object  Function Control Register */
#define CAN_MO136_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A100u)

