summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_reg.h
/** \\brief  2178, Message Object  Arbitration Register */
#define CAN_MO139_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A178u)

/** Alias (User Manual Name) for CAN_MO139_AR.
* To use register names with standard convension, please use CAN_MO139_AR.
*/
#define	CAN_MOAR139	(CAN_MO139_AR)

/** \\brief  217C, Message Object  Control Register */
#define CAN_MO139_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A17Cu)

/** Alias (User Manual Name) for CAN_MO139_CTR_STAT.
* To use register names with standard convension, please use CAN_MO139_CTR_STAT.
*/
#define	CAN_MOCTR139	(CAN_MO139_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO139_CTR_STAT.
* To use register names with standard convension, please use CAN_MO139_CTR_STAT.
*/
#define	CAN_MOSTAT139	(CAN_MO139_CTR_STAT)

/** \\brief  2174, Message Object  Data Register High */
#define CAN_MO139_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A174u)

/** Alias (User Manual Name) for CAN_MO139_DATAH.
* To use register names with standard convension, please use CAN_MO139_DATAH.
*/
#define	CAN_MODATAH139	(CAN_MO139_DATAH)

/** \\brief  2170, Message Object  Data Register Low */
#define CAN_MO139_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A170u)

/** Alias (User Manual Name) for CAN_MO139_DATAL.
* To use register names with standard convension, please use CAN_MO139_DATAL.
*/
#define	CAN_MODATAL139	(CAN_MO139_DATAL)

/** \\brief  2160, Message Object  Function Control Register */
#define CAN_MO139_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A160u)

/** Alias (User Manual Name) for CAN_MO139_FCR.
* To use register names with standard convension, please use CAN_MO139_FCR.
*/
#define	CAN_MOFCR139	(CAN_MO139_FCR)

/** \\brief  2164, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO139_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A164u)

/** Alias (User Manual Name) for CAN_MO139_FGPR.
* To use register names with standard convension, please use CAN_MO139_FGPR.
*/
#define	CAN_MOFGPR139	(CAN_MO139_FGPR)

/** \\brief  2168, Message Object  Interrupt Pointer Register */
#define CAN_MO139_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A168u)

/** Alias (User Manual Name) for CAN_MO139_IPR.
* To use register names with standard convension, please use CAN_MO139_IPR.
*/
#define	CAN_MOIPR139	(CAN_MO139_IPR)

/** \\brief  11AC, Message Object  Acceptance Mask Register */
#define CAN_MO13_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00191ACu)

/** Alias (User Manual Name) for CAN_MO13_AMR.
* To use register names with standard convension, please use CAN_MO13_AMR.
*/
#define	CAN_MOAMR13	(CAN_MO13_AMR)

/** \\brief  11B8, Message Object  Arbitration Register */
#define CAN_MO13_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00191B8u)

/** Alias (User Manual Name) for CAN_MO13_AR.
* To use register names with standard convension, please use CAN_MO13_AR.
*/
#define	CAN_MOAR13	(CAN_MO13_AR)

/** \\brief  11BC, Message Object  Control Register */
#define CAN_MO13_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF00191BCu)

/** Alias (User Manual Name) for CAN_MO13_CTR_STAT.
* To use register names with standard convension, please use CAN_MO13_CTR_STAT.
*/
#define	CAN_MOSTAT13	(CAN_MO13_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO13_CTR_STAT.
* To use register names with standard convension, please use CAN_MO13_CTR_STAT.
*/
#define	CAN_MOCTR13	(CAN_MO13_CTR_STAT)

/** \\brief  11B4, Message Object  Data Register High */
#define CAN_MO13_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00191B4u)

/** Alias (User Manual Name) for CAN_MO13_DATAH.
* To use register names with standard convension, please use CAN_MO13_DATAH.
*/
#define	CAN_MODATAH13	(CAN_MO13_DATAH)

/** \\brief  11B0, Message Object  Data Register Low */
#define CAN_MO13_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00191B0u)

/** Alias (User Manual Name) for CAN_MO13_DATAL.
* To use register names with standard convension, please use CAN_MO13_DATAL.
*/
#define	CAN_MODATAL13	(CAN_MO13_DATAL)

/** \\brief  11A0, Message Object  Function Control Register */
#define CAN_MO13_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00191A0u)

/** Alias (User Manual Name) for CAN_MO13_FCR.
* To use register names with standard convension, please use CAN_MO13_FCR.
*/
#define	CAN_MOFCR13	(CAN_MO13_FCR)

/** \\brief  11A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO13_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00191A4u)

/** Alias (User Manual Name) for CAN_MO13_FGPR.
* To use register names with standard convension, please use CAN_MO13_FGPR.
*/
#define	CAN_MOFGPR13	(CAN_MO13_FGPR)

/** \\brief  11A8, Message Object  Interrupt Pointer Register */
#define CAN_MO13_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00191A8u)

/** Alias (User Manual Name) for CAN_MO13_IPR.
* To use register names with standard convension, please use CAN_MO13_IPR.
*/
#define	CAN_MOIPR13	(CAN_MO13_IPR)

/** \\brief  218C, Message Object  Acceptance Mask Register */
#define CAN_MO140_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A18Cu)

/** Alias (User Manual Name) for CAN_MO140_AMR.
* To use register names with standard convension, please use CAN_MO140_AMR.
*/
#define	CAN_MOAMR140	(CAN_MO140_AMR)

/** \\brief  2198, Message Object  Arbitration Register */
#define CAN_MO140_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A198u)

/** Alias (User Manual Name) for CAN_MO140_AR.
* To use register names with standard convension, please use CAN_MO140_AR.
*/
#define	CAN_MOAR140	(CAN_MO140_AR)

/** \\brief  219C, Message Object  Control Register */
#define CAN_MO140_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A19Cu)

/** Alias (User Manual Name) for CAN_MO140_CTR_STAT.
* To use register names with standard convension, please use CAN_MO140_CTR_STAT.
*/
#define	CAN_MOSTAT140	(CAN_MO140_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO140_CTR_STAT.
* To use register names with standard convension, please use CAN_MO140_CTR_STAT.
*/
#define	CAN_MOCTR140	(CAN_MO140_CTR_STAT)

/** \\brief  2194, Message Object  Data Register High */
#define CAN_MO140_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A194u)

/** Alias (User Manual Name) for CAN_MO140_DATAH.
* To use register names with standard convension, please use CAN_MO140_DATAH.
*/
#define	CAN_MODATAH140	(CAN_MO140_DATAH)

/** \\brief  2190, Message Object  Data Register Low */
#define CAN_MO140_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A190u)

/** Alias (User Manual Name) for CAN_MO140_DATAL.
* To use register names with standard convension, please use CAN_MO140_DATAL.
*/
#define	CAN_MODATAL140	(CAN_MO140_DATAL)

