summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_reg.h
/** \\brief  223C, Message Object  Control Register */
#define CAN_MO145_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A23Cu)

/** Alias (User Manual Name) for CAN_MO145_CTR_STAT.
* To use register names with standard convension, please use CAN_MO145_CTR_STAT.
*/
#define	CAN_MOSTAT145	(CAN_MO145_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO145_CTR_STAT.
* To use register names with standard convension, please use CAN_MO145_CTR_STAT.
*/
#define	CAN_MOCTR145	(CAN_MO145_CTR_STAT)

/** \\brief  2234, Message Object  Data Register High */
#define CAN_MO145_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A234u)

/** Alias (User Manual Name) for CAN_MO145_DATAH.
* To use register names with standard convension, please use CAN_MO145_DATAH.
*/
#define	CAN_MODATAH145	(CAN_MO145_DATAH)

/** \\brief  2230, Message Object  Data Register Low */
#define CAN_MO145_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A230u)

/** Alias (User Manual Name) for CAN_MO145_DATAL.
* To use register names with standard convension, please use CAN_MO145_DATAL.
*/
#define	CAN_MODATAL145	(CAN_MO145_DATAL)

/** \\brief  2220, Message Object  Function Control Register */
#define CAN_MO145_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A220u)

/** Alias (User Manual Name) for CAN_MO145_FCR.
* To use register names with standard convension, please use CAN_MO145_FCR.
*/
#define	CAN_MOFCR145	(CAN_MO145_FCR)

/** \\brief  2224, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO145_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A224u)

/** Alias (User Manual Name) for CAN_MO145_FGPR.
* To use register names with standard convension, please use CAN_MO145_FGPR.
*/
#define	CAN_MOFGPR145	(CAN_MO145_FGPR)

/** \\brief  2228, Message Object  Interrupt Pointer Register */
#define CAN_MO145_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A228u)

/** Alias (User Manual Name) for CAN_MO145_IPR.
* To use register names with standard convension, please use CAN_MO145_IPR.
*/
#define	CAN_MOIPR145	(CAN_MO145_IPR)

/** \\brief  224C, Message Object  Acceptance Mask Register */
#define CAN_MO146_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A24Cu)

/** Alias (User Manual Name) for CAN_MO146_AMR.
* To use register names with standard convension, please use CAN_MO146_AMR.
*/
#define	CAN_MOAMR146	(CAN_MO146_AMR)

/** \\brief  2258, Message Object  Arbitration Register */
#define CAN_MO146_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A258u)

/** Alias (User Manual Name) for CAN_MO146_AR.
* To use register names with standard convension, please use CAN_MO146_AR.
*/
#define	CAN_MOAR146	(CAN_MO146_AR)

/** \\brief  225C, Message Object  Control Register */
#define CAN_MO146_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A25Cu)

/** Alias (User Manual Name) for CAN_MO146_CTR_STAT.
* To use register names with standard convension, please use CAN_MO146_CTR_STAT.
*/
#define	CAN_MOSTAT146	(CAN_MO146_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO146_CTR_STAT.
* To use register names with standard convension, please use CAN_MO146_CTR_STAT.
*/
#define	CAN_MOCTR146	(CAN_MO146_CTR_STAT)

/** \\brief  2254, Message Object  Data Register High */
#define CAN_MO146_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A254u)

/** Alias (User Manual Name) for CAN_MO146_DATAH.
* To use register names with standard convension, please use CAN_MO146_DATAH.
*/
#define	CAN_MODATAH146	(CAN_MO146_DATAH)

/** \\brief  2250, Message Object  Data Register Low */
#define CAN_MO146_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A250u)

/** Alias (User Manual Name) for CAN_MO146_DATAL.
* To use register names with standard convension, please use CAN_MO146_DATAL.
*/
#define	CAN_MODATAL146	(CAN_MO146_DATAL)

/** \\brief  2240, Message Object  Function Control Register */
#define CAN_MO146_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A240u)

/** Alias (User Manual Name) for CAN_MO146_FCR.
* To use register names with standard convension, please use CAN_MO146_FCR.
*/
#define	CAN_MOFCR146	(CAN_MO146_FCR)

/** \\brief  2244, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO146_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A244u)

/** Alias (User Manual Name) for CAN_MO146_FGPR.
* To use register names with standard convension, please use CAN_MO146_FGPR.
*/
#define	CAN_MOFGPR146	(CAN_MO146_FGPR)

/** \\brief  2248, Message Object  Interrupt Pointer Register */
#define CAN_MO146_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A248u)

/** Alias (User Manual Name) for CAN_MO146_IPR.
* To use register names with standard convension, please use CAN_MO146_IPR.
*/
#define	CAN_MOIPR146	(CAN_MO146_IPR)

/** \\brief  226C, Message Object  Acceptance Mask Register */
#define CAN_MO147_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A26Cu)

/** Alias (User Manual Name) for CAN_MO147_AMR.
* To use register names with standard convension, please use CAN_MO147_AMR.
*/
#define	CAN_MOAMR147	(CAN_MO147_AMR)

/** \\brief  2278, Message Object  Arbitration Register */
#define CAN_MO147_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A278u)

/** Alias (User Manual Name) for CAN_MO147_AR.
* To use register names with standard convension, please use CAN_MO147_AR.
*/
#define	CAN_MOAR147	(CAN_MO147_AR)

/** \\brief  227C, Message Object  Control Register */
#define CAN_MO147_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A27Cu)

/** Alias (User Manual Name) for CAN_MO147_CTR_STAT.
* To use register names with standard convension, please use CAN_MO147_CTR_STAT.
*/
#define	CAN_MOSTAT147	(CAN_MO147_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO147_CTR_STAT.
* To use register names with standard convension, please use CAN_MO147_CTR_STAT.
*/
#define	CAN_MOCTR147	(CAN_MO147_CTR_STAT)

/** \\brief  2274, Message Object  Data Register High */
#define CAN_MO147_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A274u)

/** Alias (User Manual Name) for CAN_MO147_DATAH.
* To use register names with standard convension, please use CAN_MO147_DATAH.
*/
#define	CAN_MODATAH147	(CAN_MO147_DATAH)

