summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_reg.h
/** \\brief  235C, Message Object  Control Register */
#define CAN_MO154_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A35Cu)

/** Alias (User Manual Name) for CAN_MO154_CTR_STAT.
* To use register names with standard convension, please use CAN_MO154_CTR_STAT.
*/
#define	CAN_MOCTR154	(CAN_MO154_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO154_CTR_STAT.
* To use register names with standard convension, please use CAN_MO154_CTR_STAT.
*/
#define	CAN_MOSTAT154	(CAN_MO154_CTR_STAT)

/** \\brief  2354, Message Object  Data Register High */
#define CAN_MO154_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A354u)

/** Alias (User Manual Name) for CAN_MO154_DATAH.
* To use register names with standard convension, please use CAN_MO154_DATAH.
*/
#define	CAN_MODATAH154	(CAN_MO154_DATAH)

/** \\brief  2350, Message Object  Data Register Low */
#define CAN_MO154_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A350u)

/** Alias (User Manual Name) for CAN_MO154_DATAL.
* To use register names with standard convension, please use CAN_MO154_DATAL.
*/
#define	CAN_MODATAL154	(CAN_MO154_DATAL)

/** \\brief  2340, Message Object  Function Control Register */
#define CAN_MO154_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A340u)

/** Alias (User Manual Name) for CAN_MO154_FCR.
* To use register names with standard convension, please use CAN_MO154_FCR.
*/
#define	CAN_MOFCR154	(CAN_MO154_FCR)

/** \\brief  2344, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO154_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A344u)

/** Alias (User Manual Name) for CAN_MO154_FGPR.
* To use register names with standard convension, please use CAN_MO154_FGPR.
*/
#define	CAN_MOFGPR154	(CAN_MO154_FGPR)

/** \\brief  2348, Message Object  Interrupt Pointer Register */
#define CAN_MO154_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A348u)

/** Alias (User Manual Name) for CAN_MO154_IPR.
* To use register names with standard convension, please use CAN_MO154_IPR.
*/
#define	CAN_MOIPR154	(CAN_MO154_IPR)

/** \\brief  236C, Message Object  Acceptance Mask Register */
#define CAN_MO155_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A36Cu)

/** Alias (User Manual Name) for CAN_MO155_AMR.
* To use register names with standard convension, please use CAN_MO155_AMR.
*/
#define	CAN_MOAMR155	(CAN_MO155_AMR)

/** \\brief  2378, Message Object  Arbitration Register */
#define CAN_MO155_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A378u)

/** Alias (User Manual Name) for CAN_MO155_AR.
* To use register names with standard convension, please use CAN_MO155_AR.
*/
#define	CAN_MOAR155	(CAN_MO155_AR)

/** \\brief  237C, Message Object  Control Register */
#define CAN_MO155_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A37Cu)

/** Alias (User Manual Name) for CAN_MO155_CTR_STAT.
* To use register names with standard convension, please use CAN_MO155_CTR_STAT.
*/
#define	CAN_MOCTR155	(CAN_MO155_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO155_CTR_STAT.
* To use register names with standard convension, please use CAN_MO155_CTR_STAT.
*/
#define	CAN_MOSTAT155	(CAN_MO155_CTR_STAT)

/** \\brief  2374, Message Object  Data Register High */
#define CAN_MO155_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A374u)

/** Alias (User Manual Name) for CAN_MO155_DATAH.
* To use register names with standard convension, please use CAN_MO155_DATAH.
*/
#define	CAN_MODATAH155	(CAN_MO155_DATAH)

/** \\brief  2370, Message Object  Data Register Low */
#define CAN_MO155_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A370u)

/** Alias (User Manual Name) for CAN_MO155_DATAL.
* To use register names with standard convension, please use CAN_MO155_DATAL.
*/
#define	CAN_MODATAL155	(CAN_MO155_DATAL)

/** \\brief  2360, Message Object  Function Control Register */
#define CAN_MO155_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A360u)

/** Alias (User Manual Name) for CAN_MO155_FCR.
* To use register names with standard convension, please use CAN_MO155_FCR.
*/
#define	CAN_MOFCR155	(CAN_MO155_FCR)

/** \\brief  2364, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO155_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A364u)

/** Alias (User Manual Name) for CAN_MO155_FGPR.
* To use register names with standard convension, please use CAN_MO155_FGPR.
*/
#define	CAN_MOFGPR155	(CAN_MO155_FGPR)

/** \\brief  2368, Message Object  Interrupt Pointer Register */
#define CAN_MO155_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A368u)

/** Alias (User Manual Name) for CAN_MO155_IPR.
* To use register names with standard convension, please use CAN_MO155_IPR.
*/
#define	CAN_MOIPR155	(CAN_MO155_IPR)

/** \\brief  238C, Message Object  Acceptance Mask Register */
#define CAN_MO156_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A38Cu)

/** Alias (User Manual Name) for CAN_MO156_AMR.
* To use register names with standard convension, please use CAN_MO156_AMR.
*/
#define	CAN_MOAMR156	(CAN_MO156_AMR)

/** \\brief  2398, Message Object  Arbitration Register */
#define CAN_MO156_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A398u)

/** Alias (User Manual Name) for CAN_MO156_AR.
* To use register names with standard convension, please use CAN_MO156_AR.
*/
#define	CAN_MOAR156	(CAN_MO156_AR)

/** \\brief  239C, Message Object  Control Register */
#define CAN_MO156_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A39Cu)

/** Alias (User Manual Name) for CAN_MO156_CTR_STAT.
* To use register names with standard convension, please use CAN_MO156_CTR_STAT.
*/
#define	CAN_MOCTR156	(CAN_MO156_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO156_CTR_STAT.
* To use register names with standard convension, please use CAN_MO156_CTR_STAT.
*/
#define	CAN_MOSTAT156	(CAN_MO156_CTR_STAT)

/** \\brief  2394, Message Object  Data Register High */
#define CAN_MO156_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A394u)

/** Alias (User Manual Name) for CAN_MO156_DATAH.
* To use register names with standard convension, please use CAN_MO156_DATAH.
*/
#define	CAN_MODATAH156	(CAN_MO156_DATAH)

/** \\brief  2390, Message Object  Data Register Low */
#define CAN_MO156_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A390u)

/** Alias (User Manual Name) for CAN_MO156_DATAL.
* To use register names with standard convension, please use CAN_MO156_DATAL.
*/
#define	CAN_MODATAL156	(CAN_MO156_DATAL)

/** \\brief  2380, Message Object  Function Control Register */
#define CAN_MO156_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A380u)

/** Alias (User Manual Name) for CAN_MO156_FCR.
* To use register names with standard convension, please use CAN_MO156_FCR.
*/
#define	CAN_MOFCR156	(CAN_MO156_FCR)

