summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_reg.h
/** \\brief  2384, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO156_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A384u)

/** Alias (User Manual Name) for CAN_MO156_FGPR.
* To use register names with standard convension, please use CAN_MO156_FGPR.
*/
#define	CAN_MOFGPR156	(CAN_MO156_FGPR)

/** \\brief  2388, Message Object  Interrupt Pointer Register */
#define CAN_MO156_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A388u)

/** Alias (User Manual Name) for CAN_MO156_IPR.
* To use register names with standard convension, please use CAN_MO156_IPR.
*/
#define	CAN_MOIPR156	(CAN_MO156_IPR)

/** \\brief  23AC, Message Object  Acceptance Mask Register */
#define CAN_MO157_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A3ACu)

/** Alias (User Manual Name) for CAN_MO157_AMR.
* To use register names with standard convension, please use CAN_MO157_AMR.
*/
#define	CAN_MOAMR157	(CAN_MO157_AMR)

/** \\brief  23B8, Message Object  Arbitration Register */
#define CAN_MO157_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A3B8u)

/** Alias (User Manual Name) for CAN_MO157_AR.
* To use register names with standard convension, please use CAN_MO157_AR.
*/
#define	CAN_MOAR157	(CAN_MO157_AR)

/** \\brief  23BC, Message Object  Control Register */
#define CAN_MO157_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A3BCu)

/** Alias (User Manual Name) for CAN_MO157_CTR_STAT.
* To use register names with standard convension, please use CAN_MO157_CTR_STAT.
*/
#define	CAN_MOCTR157	(CAN_MO157_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO157_CTR_STAT.
* To use register names with standard convension, please use CAN_MO157_CTR_STAT.
*/
#define	CAN_MOSTAT157	(CAN_MO157_CTR_STAT)

/** \\brief  23B4, Message Object  Data Register High */
#define CAN_MO157_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A3B4u)

/** Alias (User Manual Name) for CAN_MO157_DATAH.
* To use register names with standard convension, please use CAN_MO157_DATAH.
*/
#define	CAN_MODATAH157	(CAN_MO157_DATAH)

/** \\brief  23B0, Message Object  Data Register Low */
#define CAN_MO157_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A3B0u)

/** Alias (User Manual Name) for CAN_MO157_DATAL.
* To use register names with standard convension, please use CAN_MO157_DATAL.
*/
#define	CAN_MODATAL157	(CAN_MO157_DATAL)

/** \\brief  23A0, Message Object  Function Control Register */
#define CAN_MO157_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A3A0u)

/** Alias (User Manual Name) for CAN_MO157_FCR.
* To use register names with standard convension, please use CAN_MO157_FCR.
*/
#define	CAN_MOFCR157	(CAN_MO157_FCR)

/** \\brief  23A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO157_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A3A4u)

/** Alias (User Manual Name) for CAN_MO157_FGPR.
* To use register names with standard convension, please use CAN_MO157_FGPR.
*/
#define	CAN_MOFGPR157	(CAN_MO157_FGPR)

/** \\brief  23A8, Message Object  Interrupt Pointer Register */
#define CAN_MO157_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A3A8u)

/** Alias (User Manual Name) for CAN_MO157_IPR.
* To use register names with standard convension, please use CAN_MO157_IPR.
*/
#define	CAN_MOIPR157	(CAN_MO157_IPR)

/** \\brief  23CC, Message Object  Acceptance Mask Register */
#define CAN_MO158_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A3CCu)

/** Alias (User Manual Name) for CAN_MO158_AMR.
* To use register names with standard convension, please use CAN_MO158_AMR.
*/
#define	CAN_MOAMR158	(CAN_MO158_AMR)

/** \\brief  23D8, Message Object  Arbitration Register */
#define CAN_MO158_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A3D8u)

/** Alias (User Manual Name) for CAN_MO158_AR.
* To use register names with standard convension, please use CAN_MO158_AR.
*/
#define	CAN_MOAR158	(CAN_MO158_AR)

/** \\brief  23DC, Message Object  Control Register */
#define CAN_MO158_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A3DCu)

/** Alias (User Manual Name) for CAN_MO158_CTR_STAT.
* To use register names with standard convension, please use CAN_MO158_CTR_STAT.
*/
#define	CAN_MOCTR158	(CAN_MO158_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO158_CTR_STAT.
* To use register names with standard convension, please use CAN_MO158_CTR_STAT.
*/
#define	CAN_MOSTAT158	(CAN_MO158_CTR_STAT)

/** \\brief  23D4, Message Object  Data Register High */
#define CAN_MO158_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A3D4u)

/** Alias (User Manual Name) for CAN_MO158_DATAH.
* To use register names with standard convension, please use CAN_MO158_DATAH.
*/
#define	CAN_MODATAH158	(CAN_MO158_DATAH)

/** \\brief  23D0, Message Object  Data Register Low */
#define CAN_MO158_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A3D0u)

/** Alias (User Manual Name) for CAN_MO158_DATAL.
* To use register names with standard convension, please use CAN_MO158_DATAL.
*/
#define	CAN_MODATAL158	(CAN_MO158_DATAL)

/** \\brief  23C0, Message Object  Function Control Register */
#define CAN_MO158_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A3C0u)

/** Alias (User Manual Name) for CAN_MO158_FCR.
* To use register names with standard convension, please use CAN_MO158_FCR.
*/
#define	CAN_MOFCR158	(CAN_MO158_FCR)

/** \\brief  23C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO158_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A3C4u)

/** Alias (User Manual Name) for CAN_MO158_FGPR.
* To use register names with standard convension, please use CAN_MO158_FGPR.
*/
#define	CAN_MOFGPR158	(CAN_MO158_FGPR)

/** \\brief  23C8, Message Object  Interrupt Pointer Register */
#define CAN_MO158_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A3C8u)

/** Alias (User Manual Name) for CAN_MO158_IPR.
* To use register names with standard convension, please use CAN_MO158_IPR.
*/
#define	CAN_MOIPR158	(CAN_MO158_IPR)

/** \\brief  23EC, Message Object  Acceptance Mask Register */
#define CAN_MO159_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A3ECu)

