summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO159_AMR.
* To use register names with standard convension, please use CAN_MO159_AMR.
*/
#define	CAN_MOAMR159	(CAN_MO159_AMR)

/** \\brief  23F8, Message Object  Arbitration Register */
#define CAN_MO159_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A3F8u)

/** Alias (User Manual Name) for CAN_MO159_AR.
* To use register names with standard convension, please use CAN_MO159_AR.
*/
#define	CAN_MOAR159	(CAN_MO159_AR)

/** \\brief  23FC, Message Object  Control Register */
#define CAN_MO159_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A3FCu)

/** Alias (User Manual Name) for CAN_MO159_CTR_STAT.
* To use register names with standard convension, please use CAN_MO159_CTR_STAT.
*/
#define	CAN_MOCTR159	(CAN_MO159_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO159_CTR_STAT.
* To use register names with standard convension, please use CAN_MO159_CTR_STAT.
*/
#define	CAN_MOSTAT159	(CAN_MO159_CTR_STAT)

/** \\brief  23F4, Message Object  Data Register High */
#define CAN_MO159_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A3F4u)

/** Alias (User Manual Name) for CAN_MO159_DATAH.
* To use register names with standard convension, please use CAN_MO159_DATAH.
*/
#define	CAN_MODATAH159	(CAN_MO159_DATAH)

/** \\brief  23F0, Message Object  Data Register Low */
#define CAN_MO159_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A3F0u)

/** Alias (User Manual Name) for CAN_MO159_DATAL.
* To use register names with standard convension, please use CAN_MO159_DATAL.
*/
#define	CAN_MODATAL159	(CAN_MO159_DATAL)

/** \\brief  23E0, Message Object  Function Control Register */
#define CAN_MO159_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A3E0u)

/** Alias (User Manual Name) for CAN_MO159_FCR.
* To use register names with standard convension, please use CAN_MO159_FCR.
*/
#define	CAN_MOFCR159	(CAN_MO159_FCR)

/** \\brief  23E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO159_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A3E4u)

/** Alias (User Manual Name) for CAN_MO159_FGPR.
* To use register names with standard convension, please use CAN_MO159_FGPR.
*/
#define	CAN_MOFGPR159	(CAN_MO159_FGPR)

/** \\brief  23E8, Message Object  Interrupt Pointer Register */
#define CAN_MO159_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A3E8u)

/** Alias (User Manual Name) for CAN_MO159_IPR.
* To use register names with standard convension, please use CAN_MO159_IPR.
*/
#define	CAN_MOIPR159	(CAN_MO159_IPR)

/** \\brief  11EC, Message Object  Acceptance Mask Register */
#define CAN_MO15_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00191ECu)

/** Alias (User Manual Name) for CAN_MO15_AMR.
* To use register names with standard convension, please use CAN_MO15_AMR.
*/
#define	CAN_MOAMR15	(CAN_MO15_AMR)

/** \\brief  11F8, Message Object  Arbitration Register */
#define CAN_MO15_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00191F8u)

/** Alias (User Manual Name) for CAN_MO15_AR.
* To use register names with standard convension, please use CAN_MO15_AR.
*/
#define	CAN_MOAR15	(CAN_MO15_AR)

/** \\brief  11FC, Message Object  Control Register */
#define CAN_MO15_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF00191FCu)

/** Alias (User Manual Name) for CAN_MO15_CTR_STAT.
* To use register names with standard convension, please use CAN_MO15_CTR_STAT.
*/
#define	CAN_MOSTAT15	(CAN_MO15_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO15_CTR_STAT.
* To use register names with standard convension, please use CAN_MO15_CTR_STAT.
*/
#define	CAN_MOCTR15	(CAN_MO15_CTR_STAT)

/** \\brief  11F4, Message Object  Data Register High */
#define CAN_MO15_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00191F4u)

/** Alias (User Manual Name) for CAN_MO15_DATAH.
* To use register names with standard convension, please use CAN_MO15_DATAH.
*/
#define	CAN_MODATAH15	(CAN_MO15_DATAH)

/** \\brief  11F0, Message Object  Data Register Low */
#define CAN_MO15_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00191F0u)

/** Alias (User Manual Name) for CAN_MO15_DATAL.
* To use register names with standard convension, please use CAN_MO15_DATAL.
*/
#define	CAN_MODATAL15	(CAN_MO15_DATAL)

/** \\brief  11E0, Message Object  Function Control Register */
#define CAN_MO15_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00191E0u)

/** Alias (User Manual Name) for CAN_MO15_FCR.
* To use register names with standard convension, please use CAN_MO15_FCR.
*/
#define	CAN_MOFCR15	(CAN_MO15_FCR)

/** \\brief  11E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO15_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00191E4u)

/** Alias (User Manual Name) for CAN_MO15_FGPR.
* To use register names with standard convension, please use CAN_MO15_FGPR.
*/
#define	CAN_MOFGPR15	(CAN_MO15_FGPR)

/** \\brief  11E8, Message Object  Interrupt Pointer Register */
#define CAN_MO15_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00191E8u)

/** Alias (User Manual Name) for CAN_MO15_IPR.
* To use register names with standard convension, please use CAN_MO15_IPR.
*/
#define	CAN_MOIPR15	(CAN_MO15_IPR)

/** \\brief  240C, Message Object  Acceptance Mask Register */
#define CAN_MO160_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A40Cu)

/** Alias (User Manual Name) for CAN_MO160_AMR.
* To use register names with standard convension, please use CAN_MO160_AMR.
*/
#define	CAN_MOAMR160	(CAN_MO160_AMR)

/** \\brief  2418, Message Object  Arbitration Register */
#define CAN_MO160_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A418u)

/** Alias (User Manual Name) for CAN_MO160_AR.
* To use register names with standard convension, please use CAN_MO160_AR.
*/
#define	CAN_MOAR160	(CAN_MO160_AR)

/** \\brief  241C, Message Object  Control Register */
#define CAN_MO160_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A41Cu)

/** Alias (User Manual Name) for CAN_MO160_CTR_STAT.
* To use register names with standard convension, please use CAN_MO160_CTR_STAT.
*/
#define	CAN_MOSTAT160	(CAN_MO160_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO160_CTR_STAT.
* To use register names with standard convension, please use CAN_MO160_CTR_STAT.
*/
#define	CAN_MOCTR160	(CAN_MO160_CTR_STAT)

