summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_reg.h
/** \\brief  2414, Message Object  Data Register High */
#define CAN_MO160_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A414u)

/** Alias (User Manual Name) for CAN_MO160_DATAH.
* To use register names with standard convension, please use CAN_MO160_DATAH.
*/
#define	CAN_MODATAH160	(CAN_MO160_DATAH)

/** \\brief  2410, Message Object  Data Register Low */
#define CAN_MO160_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A410u)

/** Alias (User Manual Name) for CAN_MO160_DATAL.
* To use register names with standard convension, please use CAN_MO160_DATAL.
*/
#define	CAN_MODATAL160	(CAN_MO160_DATAL)

/** \\brief  2400, Message Object  Function Control Register */
#define CAN_MO160_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A400u)

/** Alias (User Manual Name) for CAN_MO160_FCR.
* To use register names with standard convension, please use CAN_MO160_FCR.
*/
#define	CAN_MOFCR160	(CAN_MO160_FCR)

/** \\brief  2404, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO160_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A404u)

/** Alias (User Manual Name) for CAN_MO160_FGPR.
* To use register names with standard convension, please use CAN_MO160_FGPR.
*/
#define	CAN_MOFGPR160	(CAN_MO160_FGPR)

/** \\brief  2408, Message Object  Interrupt Pointer Register */
#define CAN_MO160_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A408u)

/** Alias (User Manual Name) for CAN_MO160_IPR.
* To use register names with standard convension, please use CAN_MO160_IPR.
*/
#define	CAN_MOIPR160	(CAN_MO160_IPR)

/** \\brief  242C, Message Object  Acceptance Mask Register */
#define CAN_MO161_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A42Cu)

/** Alias (User Manual Name) for CAN_MO161_AMR.
* To use register names with standard convension, please use CAN_MO161_AMR.
*/
#define	CAN_MOAMR161	(CAN_MO161_AMR)

/** \\brief  2438, Message Object  Arbitration Register */
#define CAN_MO161_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A438u)

/** Alias (User Manual Name) for CAN_MO161_AR.
* To use register names with standard convension, please use CAN_MO161_AR.
*/
#define	CAN_MOAR161	(CAN_MO161_AR)

/** \\brief  243C, Message Object  Control Register */
#define CAN_MO161_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A43Cu)

/** Alias (User Manual Name) for CAN_MO161_CTR_STAT.
* To use register names with standard convension, please use CAN_MO161_CTR_STAT.
*/
#define	CAN_MOSTAT161	(CAN_MO161_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO161_CTR_STAT.
* To use register names with standard convension, please use CAN_MO161_CTR_STAT.
*/
#define	CAN_MOCTR161	(CAN_MO161_CTR_STAT)

/** \\brief  2434, Message Object  Data Register High */
#define CAN_MO161_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A434u)

/** Alias (User Manual Name) for CAN_MO161_DATAH.
* To use register names with standard convension, please use CAN_MO161_DATAH.
*/
#define	CAN_MODATAH161	(CAN_MO161_DATAH)

/** \\brief  2430, Message Object  Data Register Low */
#define CAN_MO161_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A430u)

/** Alias (User Manual Name) for CAN_MO161_DATAL.
* To use register names with standard convension, please use CAN_MO161_DATAL.
*/
#define	CAN_MODATAL161	(CAN_MO161_DATAL)

/** \\brief  2420, Message Object  Function Control Register */
#define CAN_MO161_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A420u)

/** Alias (User Manual Name) for CAN_MO161_FCR.
* To use register names with standard convension, please use CAN_MO161_FCR.
*/
#define	CAN_MOFCR161	(CAN_MO161_FCR)

/** \\brief  2424, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO161_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A424u)

/** Alias (User Manual Name) for CAN_MO161_FGPR.
* To use register names with standard convension, please use CAN_MO161_FGPR.
*/
#define	CAN_MOFGPR161	(CAN_MO161_FGPR)

/** \\brief  2428, Message Object  Interrupt Pointer Register */
#define CAN_MO161_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A428u)

/** Alias (User Manual Name) for CAN_MO161_IPR.
* To use register names with standard convension, please use CAN_MO161_IPR.
*/
#define	CAN_MOIPR161	(CAN_MO161_IPR)

/** \\brief  244C, Message Object  Acceptance Mask Register */
#define CAN_MO162_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A44Cu)

/** Alias (User Manual Name) for CAN_MO162_AMR.
* To use register names with standard convension, please use CAN_MO162_AMR.
*/
#define	CAN_MOAMR162	(CAN_MO162_AMR)

/** \\brief  2458, Message Object  Arbitration Register */
#define CAN_MO162_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A458u)

/** Alias (User Manual Name) for CAN_MO162_AR.
* To use register names with standard convension, please use CAN_MO162_AR.
*/
#define	CAN_MOAR162	(CAN_MO162_AR)

/** \\brief  245C, Message Object  Control Register */
#define CAN_MO162_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A45Cu)

/** Alias (User Manual Name) for CAN_MO162_CTR_STAT.
* To use register names with standard convension, please use CAN_MO162_CTR_STAT.
*/
#define	CAN_MOSTAT162	(CAN_MO162_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO162_CTR_STAT.
* To use register names with standard convension, please use CAN_MO162_CTR_STAT.
*/
#define	CAN_MOCTR162	(CAN_MO162_CTR_STAT)

/** \\brief  2454, Message Object  Data Register High */
#define CAN_MO162_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A454u)

/** Alias (User Manual Name) for CAN_MO162_DATAH.
* To use register names with standard convension, please use CAN_MO162_DATAH.
*/
#define	CAN_MODATAH162	(CAN_MO162_DATAH)

/** \\brief  2450, Message Object  Data Register Low */
#define CAN_MO162_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A450u)

/** Alias (User Manual Name) for CAN_MO162_DATAL.
* To use register names with standard convension, please use CAN_MO162_DATAL.
*/
#define	CAN_MODATAL162	(CAN_MO162_DATAL)

/** \\brief  2440, Message Object  Function Control Register */
#define CAN_MO162_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A440u)

/** Alias (User Manual Name) for CAN_MO162_FCR.
* To use register names with standard convension, please use CAN_MO162_FCR.
*/
#define	CAN_MOFCR162	(CAN_MO162_FCR)

/** \\brief  2444, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO162_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A444u)

/** Alias (User Manual Name) for CAN_MO162_FGPR.
* To use register names with standard convension, please use CAN_MO162_FGPR.
*/
#define	CAN_MOFGPR162	(CAN_MO162_FGPR)

