summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_reg.h
/** \\brief  2448, Message Object  Interrupt Pointer Register */
#define CAN_MO162_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A448u)

/** Alias (User Manual Name) for CAN_MO162_IPR.
* To use register names with standard convension, please use CAN_MO162_IPR.
*/
#define	CAN_MOIPR162	(CAN_MO162_IPR)

/** \\brief  246C, Message Object  Acceptance Mask Register */
#define CAN_MO163_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A46Cu)

/** Alias (User Manual Name) for CAN_MO163_AMR.
* To use register names with standard convension, please use CAN_MO163_AMR.
*/
#define	CAN_MOAMR163	(CAN_MO163_AMR)

/** \\brief  2478, Message Object  Arbitration Register */
#define CAN_MO163_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A478u)

/** Alias (User Manual Name) for CAN_MO163_AR.
* To use register names with standard convension, please use CAN_MO163_AR.
*/
#define	CAN_MOAR163	(CAN_MO163_AR)

/** \\brief  247C, Message Object  Control Register */
#define CAN_MO163_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A47Cu)

/** Alias (User Manual Name) for CAN_MO163_CTR_STAT.
* To use register names with standard convension, please use CAN_MO163_CTR_STAT.
*/
#define	CAN_MOSTAT163	(CAN_MO163_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO163_CTR_STAT.
* To use register names with standard convension, please use CAN_MO163_CTR_STAT.
*/
#define	CAN_MOCTR163	(CAN_MO163_CTR_STAT)

/** \\brief  2474, Message Object  Data Register High */
#define CAN_MO163_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A474u)

/** Alias (User Manual Name) for CAN_MO163_DATAH.
* To use register names with standard convension, please use CAN_MO163_DATAH.
*/
#define	CAN_MODATAH163	(CAN_MO163_DATAH)

/** \\brief  2470, Message Object  Data Register Low */
#define CAN_MO163_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A470u)

/** Alias (User Manual Name) for CAN_MO163_DATAL.
* To use register names with standard convension, please use CAN_MO163_DATAL.
*/
#define	CAN_MODATAL163	(CAN_MO163_DATAL)

/** \\brief  2460, Message Object  Function Control Register */
#define CAN_MO163_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A460u)

/** Alias (User Manual Name) for CAN_MO163_FCR.
* To use register names with standard convension, please use CAN_MO163_FCR.
*/
#define	CAN_MOFCR163	(CAN_MO163_FCR)

/** \\brief  2464, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO163_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A464u)

/** Alias (User Manual Name) for CAN_MO163_FGPR.
* To use register names with standard convension, please use CAN_MO163_FGPR.
*/
#define	CAN_MOFGPR163	(CAN_MO163_FGPR)

/** \\brief  2468, Message Object  Interrupt Pointer Register */
#define CAN_MO163_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A468u)

/** Alias (User Manual Name) for CAN_MO163_IPR.
* To use register names with standard convension, please use CAN_MO163_IPR.
*/
#define	CAN_MOIPR163	(CAN_MO163_IPR)

/** \\brief  248C, Message Object  Acceptance Mask Register */
#define CAN_MO164_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A48Cu)

/** Alias (User Manual Name) for CAN_MO164_AMR.
* To use register names with standard convension, please use CAN_MO164_AMR.
*/
#define	CAN_MOAMR164	(CAN_MO164_AMR)

/** \\brief  2498, Message Object  Arbitration Register */
#define CAN_MO164_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A498u)

/** Alias (User Manual Name) for CAN_MO164_AR.
* To use register names with standard convension, please use CAN_MO164_AR.
*/
#define	CAN_MOAR164	(CAN_MO164_AR)

/** \\brief  249C, Message Object  Control Register */
#define CAN_MO164_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A49Cu)

/** Alias (User Manual Name) for CAN_MO164_CTR_STAT.
* To use register names with standard convension, please use CAN_MO164_CTR_STAT.
*/
#define	CAN_MOSTAT164	(CAN_MO164_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO164_CTR_STAT.
* To use register names with standard convension, please use CAN_MO164_CTR_STAT.
*/
#define	CAN_MOCTR164	(CAN_MO164_CTR_STAT)

/** \\brief  2494, Message Object  Data Register High */
#define CAN_MO164_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A494u)

/** Alias (User Manual Name) for CAN_MO164_DATAH.
* To use register names with standard convension, please use CAN_MO164_DATAH.
*/
#define	CAN_MODATAH164	(CAN_MO164_DATAH)

/** \\brief  2490, Message Object  Data Register Low */
#define CAN_MO164_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A490u)

/** Alias (User Manual Name) for CAN_MO164_DATAL.
* To use register names with standard convension, please use CAN_MO164_DATAL.
*/
#define	CAN_MODATAL164	(CAN_MO164_DATAL)

/** \\brief  2480, Message Object  Function Control Register */
#define CAN_MO164_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A480u)

/** Alias (User Manual Name) for CAN_MO164_FCR.
* To use register names with standard convension, please use CAN_MO164_FCR.
*/
#define	CAN_MOFCR164	(CAN_MO164_FCR)

/** \\brief  2484, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO164_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A484u)

/** Alias (User Manual Name) for CAN_MO164_FGPR.
* To use register names with standard convension, please use CAN_MO164_FGPR.
*/
#define	CAN_MOFGPR164	(CAN_MO164_FGPR)

/** \\brief  2488, Message Object  Interrupt Pointer Register */
#define CAN_MO164_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A488u)

/** Alias (User Manual Name) for CAN_MO164_IPR.
* To use register names with standard convension, please use CAN_MO164_IPR.
*/
#define	CAN_MOIPR164	(CAN_MO164_IPR)

/** \\brief  24AC, Message Object  Acceptance Mask Register */
#define CAN_MO165_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A4ACu)

/** Alias (User Manual Name) for CAN_MO165_AMR.
* To use register names with standard convension, please use CAN_MO165_AMR.
*/
#define	CAN_MOAMR165	(CAN_MO165_AMR)

