summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_reg.h
/** \\brief  24B8, Message Object  Arbitration Register */
#define CAN_MO165_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A4B8u)

/** Alias (User Manual Name) for CAN_MO165_AR.
* To use register names with standard convension, please use CAN_MO165_AR.
*/
#define	CAN_MOAR165	(CAN_MO165_AR)

/** \\brief  24BC, Message Object  Control Register */
#define CAN_MO165_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A4BCu)

/** Alias (User Manual Name) for CAN_MO165_CTR_STAT.
* To use register names with standard convension, please use CAN_MO165_CTR_STAT.
*/
#define	CAN_MOSTAT165	(CAN_MO165_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO165_CTR_STAT.
* To use register names with standard convension, please use CAN_MO165_CTR_STAT.
*/
#define	CAN_MOCTR165	(CAN_MO165_CTR_STAT)

/** \\brief  24B4, Message Object  Data Register High */
#define CAN_MO165_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A4B4u)

/** Alias (User Manual Name) for CAN_MO165_DATAH.
* To use register names with standard convension, please use CAN_MO165_DATAH.
*/
#define	CAN_MODATAH165	(CAN_MO165_DATAH)

/** \\brief  24B0, Message Object  Data Register Low */
#define CAN_MO165_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A4B0u)

/** Alias (User Manual Name) for CAN_MO165_DATAL.
* To use register names with standard convension, please use CAN_MO165_DATAL.
*/
#define	CAN_MODATAL165	(CAN_MO165_DATAL)

/** \\brief  24A0, Message Object  Function Control Register */
#define CAN_MO165_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A4A0u)

/** Alias (User Manual Name) for CAN_MO165_FCR.
* To use register names with standard convension, please use CAN_MO165_FCR.
*/
#define	CAN_MOFCR165	(CAN_MO165_FCR)

/** \\brief  24A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO165_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A4A4u)

/** Alias (User Manual Name) for CAN_MO165_FGPR.
* To use register names with standard convension, please use CAN_MO165_FGPR.
*/
#define	CAN_MOFGPR165	(CAN_MO165_FGPR)

/** \\brief  24A8, Message Object  Interrupt Pointer Register */
#define CAN_MO165_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A4A8u)

/** Alias (User Manual Name) for CAN_MO165_IPR.
* To use register names with standard convension, please use CAN_MO165_IPR.
*/
#define	CAN_MOIPR165	(CAN_MO165_IPR)

/** \\brief  24CC, Message Object  Acceptance Mask Register */
#define CAN_MO166_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A4CCu)

/** Alias (User Manual Name) for CAN_MO166_AMR.
* To use register names with standard convension, please use CAN_MO166_AMR.
*/
#define	CAN_MOAMR166	(CAN_MO166_AMR)

/** \\brief  24D8, Message Object  Arbitration Register */
#define CAN_MO166_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A4D8u)

/** Alias (User Manual Name) for CAN_MO166_AR.
* To use register names with standard convension, please use CAN_MO166_AR.
*/
#define	CAN_MOAR166	(CAN_MO166_AR)

/** \\brief  24DC, Message Object  Control Register */
#define CAN_MO166_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A4DCu)

/** Alias (User Manual Name) for CAN_MO166_CTR_STAT.
* To use register names with standard convension, please use CAN_MO166_CTR_STAT.
*/
#define	CAN_MOSTAT166	(CAN_MO166_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO166_CTR_STAT.
* To use register names with standard convension, please use CAN_MO166_CTR_STAT.
*/
#define	CAN_MOCTR166	(CAN_MO166_CTR_STAT)

/** \\brief  24D4, Message Object  Data Register High */
#define CAN_MO166_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A4D4u)

/** Alias (User Manual Name) for CAN_MO166_DATAH.
* To use register names with standard convension, please use CAN_MO166_DATAH.
*/
#define	CAN_MODATAH166	(CAN_MO166_DATAH)

/** \\brief  24D0, Message Object  Data Register Low */
#define CAN_MO166_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A4D0u)

/** Alias (User Manual Name) for CAN_MO166_DATAL.
* To use register names with standard convension, please use CAN_MO166_DATAL.
*/
#define	CAN_MODATAL166	(CAN_MO166_DATAL)

/** \\brief  24C0, Message Object  Function Control Register */
#define CAN_MO166_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A4C0u)

/** Alias (User Manual Name) for CAN_MO166_FCR.
* To use register names with standard convension, please use CAN_MO166_FCR.
*/
#define	CAN_MOFCR166	(CAN_MO166_FCR)

/** \\brief  24C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO166_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A4C4u)

/** Alias (User Manual Name) for CAN_MO166_FGPR.
* To use register names with standard convension, please use CAN_MO166_FGPR.
*/
#define	CAN_MOFGPR166	(CAN_MO166_FGPR)

/** \\brief  24C8, Message Object  Interrupt Pointer Register */
#define CAN_MO166_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A4C8u)

/** Alias (User Manual Name) for CAN_MO166_IPR.
* To use register names with standard convension, please use CAN_MO166_IPR.
*/
#define	CAN_MOIPR166	(CAN_MO166_IPR)

/** \\brief  24EC, Message Object  Acceptance Mask Register */
#define CAN_MO167_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A4ECu)

/** Alias (User Manual Name) for CAN_MO167_AMR.
* To use register names with standard convension, please use CAN_MO167_AMR.
*/
#define	CAN_MOAMR167	(CAN_MO167_AMR)

/** \\brief  24F8, Message Object  Arbitration Register */
#define CAN_MO167_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A4F8u)

/** Alias (User Manual Name) for CAN_MO167_AR.
* To use register names with standard convension, please use CAN_MO167_AR.
*/
#define	CAN_MOAR167	(CAN_MO167_AR)

/** \\brief  24FC, Message Object  Control Register */
#define CAN_MO167_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A4FCu)

/** Alias (User Manual Name) for CAN_MO167_CTR_STAT.
* To use register names with standard convension, please use CAN_MO167_CTR_STAT.
*/
#define	CAN_MOSTAT167	(CAN_MO167_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO167_CTR_STAT.
* To use register names with standard convension, please use CAN_MO167_CTR_STAT.
*/
#define	CAN_MOCTR167	(CAN_MO167_CTR_STAT)

/** \\brief  24F4, Message Object  Data Register High */
#define CAN_MO167_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A4F4u)

