summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_reg.h
/** \\brief  2578, Message Object  Arbitration Register */
#define CAN_MO171_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A578u)

/** Alias (User Manual Name) for CAN_MO171_AR.
* To use register names with standard convension, please use CAN_MO171_AR.
*/
#define	CAN_MOAR171	(CAN_MO171_AR)

/** \\brief  257C, Message Object  Control Register */
#define CAN_MO171_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A57Cu)

/** Alias (User Manual Name) for CAN_MO171_CTR_STAT.
* To use register names with standard convension, please use CAN_MO171_CTR_STAT.
*/
#define	CAN_MOSTAT171	(CAN_MO171_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO171_CTR_STAT.
* To use register names with standard convension, please use CAN_MO171_CTR_STAT.
*/
#define	CAN_MOCTR171	(CAN_MO171_CTR_STAT)

/** \\brief  2574, Message Object  Data Register High */
#define CAN_MO171_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A574u)

/** Alias (User Manual Name) for CAN_MO171_DATAH.
* To use register names with standard convension, please use CAN_MO171_DATAH.
*/
#define	CAN_MODATAH171	(CAN_MO171_DATAH)

/** \\brief  2570, Message Object  Data Register Low */
#define CAN_MO171_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A570u)

/** Alias (User Manual Name) for CAN_MO171_DATAL.
* To use register names with standard convension, please use CAN_MO171_DATAL.
*/
#define	CAN_MODATAL171	(CAN_MO171_DATAL)

/** \\brief  2560, Message Object  Function Control Register */
#define CAN_MO171_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A560u)

/** Alias (User Manual Name) for CAN_MO171_FCR.
* To use register names with standard convension, please use CAN_MO171_FCR.
*/
#define	CAN_MOFCR171	(CAN_MO171_FCR)

/** \\brief  2564, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO171_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A564u)

/** Alias (User Manual Name) for CAN_MO171_FGPR.
* To use register names with standard convension, please use CAN_MO171_FGPR.
*/
#define	CAN_MOFGPR171	(CAN_MO171_FGPR)

/** \\brief  2568, Message Object  Interrupt Pointer Register */
#define CAN_MO171_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A568u)

/** Alias (User Manual Name) for CAN_MO171_IPR.
* To use register names with standard convension, please use CAN_MO171_IPR.
*/
#define	CAN_MOIPR171	(CAN_MO171_IPR)

/** \\brief  258C, Message Object  Acceptance Mask Register */
#define CAN_MO172_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A58Cu)

/** Alias (User Manual Name) for CAN_MO172_AMR.
* To use register names with standard convension, please use CAN_MO172_AMR.
*/
#define	CAN_MOAMR172	(CAN_MO172_AMR)

/** \\brief  2598, Message Object  Arbitration Register */
#define CAN_MO172_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A598u)

/** Alias (User Manual Name) for CAN_MO172_AR.
* To use register names with standard convension, please use CAN_MO172_AR.
*/
#define	CAN_MOAR172	(CAN_MO172_AR)

/** \\brief  259C, Message Object  Control Register */
#define CAN_MO172_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A59Cu)

/** Alias (User Manual Name) for CAN_MO172_CTR_STAT.
* To use register names with standard convension, please use CAN_MO172_CTR_STAT.
*/
#define	CAN_MOSTAT172	(CAN_MO172_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO172_CTR_STAT.
* To use register names with standard convension, please use CAN_MO172_CTR_STAT.
*/
#define	CAN_MOCTR172	(CAN_MO172_CTR_STAT)

/** \\brief  2594, Message Object  Data Register High */
#define CAN_MO172_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A594u)

/** Alias (User Manual Name) for CAN_MO172_DATAH.
* To use register names with standard convension, please use CAN_MO172_DATAH.
*/
#define	CAN_MODATAH172	(CAN_MO172_DATAH)

/** \\brief  2590, Message Object  Data Register Low */
#define CAN_MO172_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A590u)

/** Alias (User Manual Name) for CAN_MO172_DATAL.
* To use register names with standard convension, please use CAN_MO172_DATAL.
*/
#define	CAN_MODATAL172	(CAN_MO172_DATAL)

/** \\brief  2580, Message Object  Function Control Register */
#define CAN_MO172_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A580u)

/** Alias (User Manual Name) for CAN_MO172_FCR.
* To use register names with standard convension, please use CAN_MO172_FCR.
*/
#define	CAN_MOFCR172	(CAN_MO172_FCR)

/** \\brief  2584, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO172_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A584u)

/** Alias (User Manual Name) for CAN_MO172_FGPR.
* To use register names with standard convension, please use CAN_MO172_FGPR.
*/
#define	CAN_MOFGPR172	(CAN_MO172_FGPR)

/** \\brief  2588, Message Object  Interrupt Pointer Register */
#define CAN_MO172_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A588u)

/** Alias (User Manual Name) for CAN_MO172_IPR.
* To use register names with standard convension, please use CAN_MO172_IPR.
*/
#define	CAN_MOIPR172	(CAN_MO172_IPR)

/** \\brief  25AC, Message Object  Acceptance Mask Register */
#define CAN_MO173_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A5ACu)

/** Alias (User Manual Name) for CAN_MO173_AMR.
* To use register names with standard convension, please use CAN_MO173_AMR.
*/
#define	CAN_MOAMR173	(CAN_MO173_AMR)

/** \\brief  25B8, Message Object  Arbitration Register */
#define CAN_MO173_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A5B8u)

/** Alias (User Manual Name) for CAN_MO173_AR.
* To use register names with standard convension, please use CAN_MO173_AR.
*/
#define	CAN_MOAR173	(CAN_MO173_AR)

/** \\brief  25BC, Message Object  Control Register */
#define CAN_MO173_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A5BCu)

/** Alias (User Manual Name) for CAN_MO173_CTR_STAT.
* To use register names with standard convension, please use CAN_MO173_CTR_STAT.
*/
#define	CAN_MOSTAT173	(CAN_MO173_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO173_CTR_STAT.
* To use register names with standard convension, please use CAN_MO173_CTR_STAT.
*/
#define	CAN_MOCTR173	(CAN_MO173_CTR_STAT)

/** \\brief  25B4, Message Object  Data Register High */
#define CAN_MO173_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A5B4u)

/** Alias (User Manual Name) for CAN_MO173_DATAH.
* To use register names with standard convension, please use CAN_MO173_DATAH.
*/
#define	CAN_MODATAH173	(CAN_MO173_DATAH)

/** \\brief  25B0, Message Object  Data Register Low */
#define CAN_MO173_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A5B0u)

/** Alias (User Manual Name) for CAN_MO173_DATAL.
* To use register names with standard convension, please use CAN_MO173_DATAL.
*/
#define	CAN_MODATAL173	(CAN_MO173_DATAL)

/** \\brief  25A0, Message Object  Function Control Register */
#define CAN_MO173_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A5A0u)

