summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO173_FCR.
* To use register names with standard convension, please use CAN_MO173_FCR.
*/
#define	CAN_MOFCR173	(CAN_MO173_FCR)

/** \\brief  25A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO173_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A5A4u)

/** Alias (User Manual Name) for CAN_MO173_FGPR.
* To use register names with standard convension, please use CAN_MO173_FGPR.
*/
#define	CAN_MOFGPR173	(CAN_MO173_FGPR)

/** \\brief  25A8, Message Object  Interrupt Pointer Register */
#define CAN_MO173_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A5A8u)

/** Alias (User Manual Name) for CAN_MO173_IPR.
* To use register names with standard convension, please use CAN_MO173_IPR.
*/
#define	CAN_MOIPR173	(CAN_MO173_IPR)

/** \\brief  25CC, Message Object  Acceptance Mask Register */
#define CAN_MO174_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A5CCu)

/** Alias (User Manual Name) for CAN_MO174_AMR.
* To use register names with standard convension, please use CAN_MO174_AMR.
*/
#define	CAN_MOAMR174	(CAN_MO174_AMR)

/** \\brief  25D8, Message Object  Arbitration Register */
#define CAN_MO174_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A5D8u)

/** Alias (User Manual Name) for CAN_MO174_AR.
* To use register names with standard convension, please use CAN_MO174_AR.
*/
#define	CAN_MOAR174	(CAN_MO174_AR)

/** \\brief  25DC, Message Object  Control Register */
#define CAN_MO174_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A5DCu)

/** Alias (User Manual Name) for CAN_MO174_CTR_STAT.
* To use register names with standard convension, please use CAN_MO174_CTR_STAT.
*/
#define	CAN_MOSTAT174	(CAN_MO174_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO174_CTR_STAT.
* To use register names with standard convension, please use CAN_MO174_CTR_STAT.
*/
#define	CAN_MOCTR174	(CAN_MO174_CTR_STAT)

/** \\brief  25D4, Message Object  Data Register High */
#define CAN_MO174_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A5D4u)

/** Alias (User Manual Name) for CAN_MO174_DATAH.
* To use register names with standard convension, please use CAN_MO174_DATAH.
*/
#define	CAN_MODATAH174	(CAN_MO174_DATAH)

/** \\brief  25D0, Message Object  Data Register Low */
#define CAN_MO174_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A5D0u)

/** Alias (User Manual Name) for CAN_MO174_DATAL.
* To use register names with standard convension, please use CAN_MO174_DATAL.
*/
#define	CAN_MODATAL174	(CAN_MO174_DATAL)

/** \\brief  25C0, Message Object  Function Control Register */
#define CAN_MO174_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A5C0u)

/** Alias (User Manual Name) for CAN_MO174_FCR.
* To use register names with standard convension, please use CAN_MO174_FCR.
*/
#define	CAN_MOFCR174	(CAN_MO174_FCR)

/** \\brief  25C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO174_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A5C4u)

/** Alias (User Manual Name) for CAN_MO174_FGPR.
* To use register names with standard convension, please use CAN_MO174_FGPR.
*/
#define	CAN_MOFGPR174	(CAN_MO174_FGPR)

/** \\brief  25C8, Message Object  Interrupt Pointer Register */
#define CAN_MO174_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A5C8u)

/** Alias (User Manual Name) for CAN_MO174_IPR.
* To use register names with standard convension, please use CAN_MO174_IPR.
*/
#define	CAN_MOIPR174	(CAN_MO174_IPR)

/** \\brief  25EC, Message Object  Acceptance Mask Register */
#define CAN_MO175_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A5ECu)

/** Alias (User Manual Name) for CAN_MO175_AMR.
* To use register names with standard convension, please use CAN_MO175_AMR.
*/
#define	CAN_MOAMR175	(CAN_MO175_AMR)

/** \\brief  25F8, Message Object  Arbitration Register */
#define CAN_MO175_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A5F8u)

/** Alias (User Manual Name) for CAN_MO175_AR.
* To use register names with standard convension, please use CAN_MO175_AR.
*/
#define	CAN_MOAR175	(CAN_MO175_AR)

/** \\brief  25FC, Message Object  Control Register */
#define CAN_MO175_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A5FCu)

/** Alias (User Manual Name) for CAN_MO175_CTR_STAT.
* To use register names with standard convension, please use CAN_MO175_CTR_STAT.
*/
#define	CAN_MOSTAT175	(CAN_MO175_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO175_CTR_STAT.
* To use register names with standard convension, please use CAN_MO175_CTR_STAT.
*/
#define	CAN_MOCTR175	(CAN_MO175_CTR_STAT)

/** \\brief  25F4, Message Object  Data Register High */
#define CAN_MO175_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A5F4u)

/** Alias (User Manual Name) for CAN_MO175_DATAH.
* To use register names with standard convension, please use CAN_MO175_DATAH.
*/
#define	CAN_MODATAH175	(CAN_MO175_DATAH)

/** \\brief  25F0, Message Object  Data Register Low */
#define CAN_MO175_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A5F0u)

/** Alias (User Manual Name) for CAN_MO175_DATAL.
* To use register names with standard convension, please use CAN_MO175_DATAL.
*/
#define	CAN_MODATAL175	(CAN_MO175_DATAL)

/** \\brief  25E0, Message Object  Function Control Register */
#define CAN_MO175_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A5E0u)

/** Alias (User Manual Name) for CAN_MO175_FCR.
* To use register names with standard convension, please use CAN_MO175_FCR.
*/
#define	CAN_MOFCR175	(CAN_MO175_FCR)

/** \\brief  25E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO175_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A5E4u)

/** Alias (User Manual Name) for CAN_MO175_FGPR.
* To use register names with standard convension, please use CAN_MO175_FGPR.
*/
#define	CAN_MOFGPR175	(CAN_MO175_FGPR)

/** \\brief  25E8, Message Object  Interrupt Pointer Register */
#define CAN_MO175_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A5E8u)

/** Alias (User Manual Name) for CAN_MO175_IPR.
* To use register names with standard convension, please use CAN_MO175_IPR.
*/
#define	CAN_MOIPR175	(CAN_MO175_IPR)

/** \\brief  260C, Message Object  Acceptance Mask Register */
#define CAN_MO176_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A60Cu)

