summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_reg.h
/** \\brief  26F4, Message Object  Data Register High */
#define CAN_MO183_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A6F4u)

/** Alias (User Manual Name) for CAN_MO183_DATAH.
* To use register names with standard convension, please use CAN_MO183_DATAH.
*/
#define	CAN_MODATAH183	(CAN_MO183_DATAH)

/** \\brief  26F0, Message Object  Data Register Low */
#define CAN_MO183_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A6F0u)

/** Alias (User Manual Name) for CAN_MO183_DATAL.
* To use register names with standard convension, please use CAN_MO183_DATAL.
*/
#define	CAN_MODATAL183	(CAN_MO183_DATAL)

/** \\brief  26E0, Message Object  Function Control Register */
#define CAN_MO183_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A6E0u)

/** Alias (User Manual Name) for CAN_MO183_FCR.
* To use register names with standard convension, please use CAN_MO183_FCR.
*/
#define	CAN_MOFCR183	(CAN_MO183_FCR)

/** \\brief  26E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO183_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A6E4u)

/** Alias (User Manual Name) for CAN_MO183_FGPR.
* To use register names with standard convension, please use CAN_MO183_FGPR.
*/
#define	CAN_MOFGPR183	(CAN_MO183_FGPR)

/** \\brief  26E8, Message Object  Interrupt Pointer Register */
#define CAN_MO183_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A6E8u)

/** Alias (User Manual Name) for CAN_MO183_IPR.
* To use register names with standard convension, please use CAN_MO183_IPR.
*/
#define	CAN_MOIPR183	(CAN_MO183_IPR)

/** \\brief  270C, Message Object  Acceptance Mask Register */
#define CAN_MO184_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A70Cu)

/** Alias (User Manual Name) for CAN_MO184_AMR.
* To use register names with standard convension, please use CAN_MO184_AMR.
*/
#define	CAN_MOAMR184	(CAN_MO184_AMR)

/** \\brief  2718, Message Object  Arbitration Register */
#define CAN_MO184_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A718u)

/** Alias (User Manual Name) for CAN_MO184_AR.
* To use register names with standard convension, please use CAN_MO184_AR.
*/
#define	CAN_MOAR184	(CAN_MO184_AR)

/** \\brief  271C, Message Object  Control Register */
#define CAN_MO184_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A71Cu)

/** Alias (User Manual Name) for CAN_MO184_CTR_STAT.
* To use register names with standard convension, please use CAN_MO184_CTR_STAT.
*/
#define	CAN_MOCTR184	(CAN_MO184_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO184_CTR_STAT.
* To use register names with standard convension, please use CAN_MO184_CTR_STAT.
*/
#define	CAN_MOSTAT184	(CAN_MO184_CTR_STAT)

/** \\brief  2714, Message Object  Data Register High */
#define CAN_MO184_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A714u)

/** Alias (User Manual Name) for CAN_MO184_DATAH.
* To use register names with standard convension, please use CAN_MO184_DATAH.
*/
#define	CAN_MODATAH184	(CAN_MO184_DATAH)

/** \\brief  2710, Message Object  Data Register Low */
#define CAN_MO184_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A710u)

/** Alias (User Manual Name) for CAN_MO184_DATAL.
* To use register names with standard convension, please use CAN_MO184_DATAL.
*/
#define	CAN_MODATAL184	(CAN_MO184_DATAL)

/** \\brief  2700, Message Object  Function Control Register */
#define CAN_MO184_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A700u)

/** Alias (User Manual Name) for CAN_MO184_FCR.
* To use register names with standard convension, please use CAN_MO184_FCR.
*/
#define	CAN_MOFCR184	(CAN_MO184_FCR)

/** \\brief  2704, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO184_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A704u)

/** Alias (User Manual Name) for CAN_MO184_FGPR.
* To use register names with standard convension, please use CAN_MO184_FGPR.
*/
#define	CAN_MOFGPR184	(CAN_MO184_FGPR)

/** \\brief  2708, Message Object  Interrupt Pointer Register */
#define CAN_MO184_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A708u)

/** Alias (User Manual Name) for CAN_MO184_IPR.
* To use register names with standard convension, please use CAN_MO184_IPR.
*/
#define	CAN_MOIPR184	(CAN_MO184_IPR)

/** \\brief  272C, Message Object  Acceptance Mask Register */
#define CAN_MO185_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A72Cu)

/** Alias (User Manual Name) for CAN_MO185_AMR.
* To use register names with standard convension, please use CAN_MO185_AMR.
*/
#define	CAN_MOAMR185	(CAN_MO185_AMR)

/** \\brief  2738, Message Object  Arbitration Register */
#define CAN_MO185_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A738u)

/** Alias (User Manual Name) for CAN_MO185_AR.
* To use register names with standard convension, please use CAN_MO185_AR.
*/
#define	CAN_MOAR185	(CAN_MO185_AR)

/** \\brief  273C, Message Object  Control Register */
#define CAN_MO185_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A73Cu)

/** Alias (User Manual Name) for CAN_MO185_CTR_STAT.
* To use register names with standard convension, please use CAN_MO185_CTR_STAT.
*/
#define	CAN_MOCTR185	(CAN_MO185_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO185_CTR_STAT.
* To use register names with standard convension, please use CAN_MO185_CTR_STAT.
*/
#define	CAN_MOSTAT185	(CAN_MO185_CTR_STAT)

/** \\brief  2734, Message Object  Data Register High */
#define CAN_MO185_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A734u)

/** Alias (User Manual Name) for CAN_MO185_DATAH.
* To use register names with standard convension, please use CAN_MO185_DATAH.
*/
#define	CAN_MODATAH185	(CAN_MO185_DATAH)

/** \\brief  2730, Message Object  Data Register Low */
#define CAN_MO185_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A730u)

/** Alias (User Manual Name) for CAN_MO185_DATAL.
* To use register names with standard convension, please use CAN_MO185_DATAL.
*/
#define	CAN_MODATAL185	(CAN_MO185_DATAL)

/** \\brief  2720, Message Object  Function Control Register */
#define CAN_MO185_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A720u)

