summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO187_IPR.
* To use register names with standard convension, please use CAN_MO187_IPR.
*/
#define	CAN_MOIPR187	(CAN_MO187_IPR)

/** \\brief  278C, Message Object  Acceptance Mask Register */
#define CAN_MO188_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A78Cu)

/** Alias (User Manual Name) for CAN_MO188_AMR.
* To use register names with standard convension, please use CAN_MO188_AMR.
*/
#define	CAN_MOAMR188	(CAN_MO188_AMR)

/** \\brief  2798, Message Object  Arbitration Register */
#define CAN_MO188_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A798u)

/** Alias (User Manual Name) for CAN_MO188_AR.
* To use register names with standard convension, please use CAN_MO188_AR.
*/
#define	CAN_MOAR188	(CAN_MO188_AR)

/** \\brief  279C, Message Object  Control Register */
#define CAN_MO188_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A79Cu)

/** Alias (User Manual Name) for CAN_MO188_CTR_STAT.
* To use register names with standard convension, please use CAN_MO188_CTR_STAT.
*/
#define	CAN_MOCTR188	(CAN_MO188_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO188_CTR_STAT.
* To use register names with standard convension, please use CAN_MO188_CTR_STAT.
*/
#define	CAN_MOSTAT188	(CAN_MO188_CTR_STAT)

/** \\brief  2794, Message Object  Data Register High */
#define CAN_MO188_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A794u)

/** Alias (User Manual Name) for CAN_MO188_DATAH.
* To use register names with standard convension, please use CAN_MO188_DATAH.
*/
#define	CAN_MODATAH188	(CAN_MO188_DATAH)

/** \\brief  2790, Message Object  Data Register Low */
#define CAN_MO188_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A790u)

/** Alias (User Manual Name) for CAN_MO188_DATAL.
* To use register names with standard convension, please use CAN_MO188_DATAL.
*/
#define	CAN_MODATAL188	(CAN_MO188_DATAL)

/** \\brief  2780, Message Object  Function Control Register */
#define CAN_MO188_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A780u)

/** Alias (User Manual Name) for CAN_MO188_FCR.
* To use register names with standard convension, please use CAN_MO188_FCR.
*/
#define	CAN_MOFCR188	(CAN_MO188_FCR)

/** \\brief  2784, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO188_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A784u)

/** Alias (User Manual Name) for CAN_MO188_FGPR.
* To use register names with standard convension, please use CAN_MO188_FGPR.
*/
#define	CAN_MOFGPR188	(CAN_MO188_FGPR)

/** \\brief  2788, Message Object  Interrupt Pointer Register */
#define CAN_MO188_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A788u)

/** Alias (User Manual Name) for CAN_MO188_IPR.
* To use register names with standard convension, please use CAN_MO188_IPR.
*/
#define	CAN_MOIPR188	(CAN_MO188_IPR)

/** \\brief  27AC, Message Object  Acceptance Mask Register */
#define CAN_MO189_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A7ACu)

/** Alias (User Manual Name) for CAN_MO189_AMR.
* To use register names with standard convension, please use CAN_MO189_AMR.
*/
#define	CAN_MOAMR189	(CAN_MO189_AMR)

/** \\brief  27B8, Message Object  Arbitration Register */
#define CAN_MO189_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A7B8u)

/** Alias (User Manual Name) for CAN_MO189_AR.
* To use register names with standard convension, please use CAN_MO189_AR.
*/
#define	CAN_MOAR189	(CAN_MO189_AR)

/** \\brief  27BC, Message Object  Control Register */
#define CAN_MO189_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A7BCu)

/** Alias (User Manual Name) for CAN_MO189_CTR_STAT.
* To use register names with standard convension, please use CAN_MO189_CTR_STAT.
*/
#define	CAN_MOCTR189	(CAN_MO189_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO189_CTR_STAT.
* To use register names with standard convension, please use CAN_MO189_CTR_STAT.
*/
#define	CAN_MOSTAT189	(CAN_MO189_CTR_STAT)

/** \\brief  27B4, Message Object  Data Register High */
#define CAN_MO189_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A7B4u)

/** Alias (User Manual Name) for CAN_MO189_DATAH.
* To use register names with standard convension, please use CAN_MO189_DATAH.
*/
#define	CAN_MODATAH189	(CAN_MO189_DATAH)

/** \\brief  27B0, Message Object  Data Register Low */
#define CAN_MO189_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A7B0u)

/** Alias (User Manual Name) for CAN_MO189_DATAL.
* To use register names with standard convension, please use CAN_MO189_DATAL.
*/
#define	CAN_MODATAL189	(CAN_MO189_DATAL)

/** \\brief  27A0, Message Object  Function Control Register */
#define CAN_MO189_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A7A0u)

/** Alias (User Manual Name) for CAN_MO189_FCR.
* To use register names with standard convension, please use CAN_MO189_FCR.
*/
#define	CAN_MOFCR189	(CAN_MO189_FCR)

/** \\brief  27A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO189_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A7A4u)

/** Alias (User Manual Name) for CAN_MO189_FGPR.
* To use register names with standard convension, please use CAN_MO189_FGPR.
*/
#define	CAN_MOFGPR189	(CAN_MO189_FGPR)

/** \\brief  27A8, Message Object  Interrupt Pointer Register */
#define CAN_MO189_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A7A8u)

/** Alias (User Manual Name) for CAN_MO189_IPR.
* To use register names with standard convension, please use CAN_MO189_IPR.
*/
#define	CAN_MOIPR189	(CAN_MO189_IPR)

/** \\brief  124C, Message Object  Acceptance Mask Register */
#define CAN_MO18_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001924Cu)

/** Alias (User Manual Name) for CAN_MO18_AMR.
* To use register names with standard convension, please use CAN_MO18_AMR.
*/
#define	CAN_MOAMR18	(CAN_MO18_AMR)

/** \\brief  1258, Message Object  Arbitration Register */
#define CAN_MO18_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019258u)

/** Alias (User Manual Name) for CAN_MO18_AR.
* To use register names with standard convension, please use CAN_MO18_AR.
*/
#define	CAN_MOAR18	(CAN_MO18_AR)

/** \\brief  125C, Message Object  Control Register */
#define CAN_MO18_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001925Cu)

