summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO18_CTR_STAT.
* To use register names with standard convension, please use CAN_MO18_CTR_STAT.
*/
#define	CAN_MOSTAT18	(CAN_MO18_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO18_CTR_STAT.
* To use register names with standard convension, please use CAN_MO18_CTR_STAT.
*/
#define	CAN_MOCTR18	(CAN_MO18_CTR_STAT)

/** \\brief  1254, Message Object  Data Register High */
#define CAN_MO18_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019254u)

/** Alias (User Manual Name) for CAN_MO18_DATAH.
* To use register names with standard convension, please use CAN_MO18_DATAH.
*/
#define	CAN_MODATAH18	(CAN_MO18_DATAH)

/** \\brief  1250, Message Object  Data Register Low */
#define CAN_MO18_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019250u)

/** Alias (User Manual Name) for CAN_MO18_DATAL.
* To use register names with standard convension, please use CAN_MO18_DATAL.
*/
#define	CAN_MODATAL18	(CAN_MO18_DATAL)

/** \\brief  1240, Message Object  Function Control Register */
#define CAN_MO18_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019240u)

/** Alias (User Manual Name) for CAN_MO18_FCR.
* To use register names with standard convension, please use CAN_MO18_FCR.
*/
#define	CAN_MOFCR18	(CAN_MO18_FCR)

/** \\brief  1244, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO18_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019244u)

/** Alias (User Manual Name) for CAN_MO18_FGPR.
* To use register names with standard convension, please use CAN_MO18_FGPR.
*/
#define	CAN_MOFGPR18	(CAN_MO18_FGPR)

/** \\brief  1248, Message Object  Interrupt Pointer Register */
#define CAN_MO18_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019248u)

/** Alias (User Manual Name) for CAN_MO18_IPR.
* To use register names with standard convension, please use CAN_MO18_IPR.
*/
#define	CAN_MOIPR18	(CAN_MO18_IPR)

/** \\brief  27CC, Message Object  Acceptance Mask Register */
#define CAN_MO190_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A7CCu)

/** Alias (User Manual Name) for CAN_MO190_AMR.
* To use register names with standard convension, please use CAN_MO190_AMR.
*/
#define	CAN_MOAMR190	(CAN_MO190_AMR)

/** \\brief  27D8, Message Object  Arbitration Register */
#define CAN_MO190_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A7D8u)

/** Alias (User Manual Name) for CAN_MO190_AR.
* To use register names with standard convension, please use CAN_MO190_AR.
*/
#define	CAN_MOAR190	(CAN_MO190_AR)

/** \\brief  27DC, Message Object  Control Register */
#define CAN_MO190_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A7DCu)

/** Alias (User Manual Name) for CAN_MO190_CTR_STAT.
* To use register names with standard convension, please use CAN_MO190_CTR_STAT.
*/
#define	CAN_MOSTAT190	(CAN_MO190_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO190_CTR_STAT.
* To use register names with standard convension, please use CAN_MO190_CTR_STAT.
*/
#define	CAN_MOCTR190	(CAN_MO190_CTR_STAT)

/** \\brief  27D4, Message Object  Data Register High */
#define CAN_MO190_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A7D4u)

/** Alias (User Manual Name) for CAN_MO190_DATAH.
* To use register names with standard convension, please use CAN_MO190_DATAH.
*/
#define	CAN_MODATAH190	(CAN_MO190_DATAH)

/** \\brief  27D0, Message Object  Data Register Low */
#define CAN_MO190_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A7D0u)

/** Alias (User Manual Name) for CAN_MO190_DATAL.
* To use register names with standard convension, please use CAN_MO190_DATAL.
*/
#define	CAN_MODATAL190	(CAN_MO190_DATAL)

/** \\brief  27C0, Message Object  Function Control Register */
#define CAN_MO190_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A7C0u)

/** Alias (User Manual Name) for CAN_MO190_FCR.
* To use register names with standard convension, please use CAN_MO190_FCR.
*/
#define	CAN_MOFCR190	(CAN_MO190_FCR)

/** \\brief  27C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO190_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A7C4u)

/** Alias (User Manual Name) for CAN_MO190_FGPR.
* To use register names with standard convension, please use CAN_MO190_FGPR.
*/
#define	CAN_MOFGPR190	(CAN_MO190_FGPR)

/** \\brief  27C8, Message Object  Interrupt Pointer Register */
#define CAN_MO190_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A7C8u)

/** Alias (User Manual Name) for CAN_MO190_IPR.
* To use register names with standard convension, please use CAN_MO190_IPR.
*/
#define	CAN_MOIPR190	(CAN_MO190_IPR)

/** \\brief  27EC, Message Object  Acceptance Mask Register */
#define CAN_MO191_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A7ECu)

/** Alias (User Manual Name) for CAN_MO191_AMR.
* To use register names with standard convension, please use CAN_MO191_AMR.
*/
#define	CAN_MOAMR191	(CAN_MO191_AMR)

/** \\brief  27F8, Message Object  Arbitration Register */
#define CAN_MO191_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A7F8u)

/** Alias (User Manual Name) for CAN_MO191_AR.
* To use register names with standard convension, please use CAN_MO191_AR.
*/
#define	CAN_MOAR191	(CAN_MO191_AR)

/** \\brief  27FC, Message Object  Control Register */
#define CAN_MO191_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A7FCu)

/** Alias (User Manual Name) for CAN_MO191_CTR_STAT.
* To use register names with standard convension, please use CAN_MO191_CTR_STAT.
*/
#define	CAN_MOCTR191	(CAN_MO191_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO191_CTR_STAT.
* To use register names with standard convension, please use CAN_MO191_CTR_STAT.
*/
#define	CAN_MOSTAT191	(CAN_MO191_CTR_STAT)

/** \\brief  27F4, Message Object  Data Register High */
#define CAN_MO191_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A7F4u)

/** Alias (User Manual Name) for CAN_MO191_DATAH.
* To use register names with standard convension, please use CAN_MO191_DATAH.
*/
#define	CAN_MODATAH191	(CAN_MO191_DATAH)

/** \\brief  27F0, Message Object  Data Register Low */
#define CAN_MO191_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A7F0u)

/** Alias (User Manual Name) for CAN_MO191_DATAL.
* To use register names with standard convension, please use CAN_MO191_DATAL.
*/
#define	CAN_MODATAL191	(CAN_MO191_DATAL)

/** \\brief  27E0, Message Object  Function Control Register */
#define CAN_MO191_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A7E0u)

/** Alias (User Manual Name) for CAN_MO191_FCR.
* To use register names with standard convension, please use CAN_MO191_FCR.
*/
#define	CAN_MOFCR191	(CAN_MO191_FCR)

