summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_reg.h
/** \\brief  27E4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO191_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A7E4u)

/** Alias (User Manual Name) for CAN_MO191_FGPR.
* To use register names with standard convension, please use CAN_MO191_FGPR.
*/
#define	CAN_MOFGPR191	(CAN_MO191_FGPR)

/** \\brief  27E8, Message Object  Interrupt Pointer Register */
#define CAN_MO191_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A7E8u)

/** Alias (User Manual Name) for CAN_MO191_IPR.
* To use register names with standard convension, please use CAN_MO191_IPR.
*/
#define	CAN_MOIPR191	(CAN_MO191_IPR)

/** \\brief  280C, Message Object  Acceptance Mask Register */
#define CAN_MO192_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A80Cu)

/** Alias (User Manual Name) for CAN_MO192_AMR.
* To use register names with standard convension, please use CAN_MO192_AMR.
*/
#define	CAN_MOAMR192	(CAN_MO192_AMR)

/** \\brief  2818, Message Object  Arbitration Register */
#define CAN_MO192_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A818u)

/** Alias (User Manual Name) for CAN_MO192_AR.
* To use register names with standard convension, please use CAN_MO192_AR.
*/
#define	CAN_MOAR192	(CAN_MO192_AR)

/** \\brief  281C, Message Object  Control Register */
#define CAN_MO192_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A81Cu)

/** Alias (User Manual Name) for CAN_MO192_CTR_STAT.
* To use register names with standard convension, please use CAN_MO192_CTR_STAT.
*/
#define	CAN_MOCTR192	(CAN_MO192_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO192_CTR_STAT.
* To use register names with standard convension, please use CAN_MO192_CTR_STAT.
*/
#define	CAN_MOSTAT192	(CAN_MO192_CTR_STAT)

/** \\brief  2814, Message Object  Data Register High */
#define CAN_MO192_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A814u)

/** Alias (User Manual Name) for CAN_MO192_DATAH.
* To use register names with standard convension, please use CAN_MO192_DATAH.
*/
#define	CAN_MODATAH192	(CAN_MO192_DATAH)

/** \\brief  2810, Message Object  Data Register Low */
#define CAN_MO192_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A810u)

/** Alias (User Manual Name) for CAN_MO192_DATAL.
* To use register names with standard convension, please use CAN_MO192_DATAL.
*/
#define	CAN_MODATAL192	(CAN_MO192_DATAL)

/** \\brief  2800, Message Object  Function Control Register */
#define CAN_MO192_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A800u)

/** Alias (User Manual Name) for CAN_MO192_FCR.
* To use register names with standard convension, please use CAN_MO192_FCR.
*/
#define	CAN_MOFCR192	(CAN_MO192_FCR)

/** \\brief  2804, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO192_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A804u)

/** Alias (User Manual Name) for CAN_MO192_FGPR.
* To use register names with standard convension, please use CAN_MO192_FGPR.
*/
#define	CAN_MOFGPR192	(CAN_MO192_FGPR)

/** \\brief  2808, Message Object  Interrupt Pointer Register */
#define CAN_MO192_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A808u)

/** Alias (User Manual Name) for CAN_MO192_IPR.
* To use register names with standard convension, please use CAN_MO192_IPR.
*/
#define	CAN_MOIPR192	(CAN_MO192_IPR)

/** \\brief  282C, Message Object  Acceptance Mask Register */
#define CAN_MO193_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A82Cu)

/** Alias (User Manual Name) for CAN_MO193_AMR.
* To use register names with standard convension, please use CAN_MO193_AMR.
*/
#define	CAN_MOAMR193	(CAN_MO193_AMR)

/** \\brief  2838, Message Object  Arbitration Register */
#define CAN_MO193_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A838u)

/** Alias (User Manual Name) for CAN_MO193_AR.
* To use register names with standard convension, please use CAN_MO193_AR.
*/
#define	CAN_MOAR193	(CAN_MO193_AR)

/** \\brief  283C, Message Object  Control Register */
#define CAN_MO193_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A83Cu)

/** Alias (User Manual Name) for CAN_MO193_CTR_STAT.
* To use register names with standard convension, please use CAN_MO193_CTR_STAT.
*/
#define	CAN_MOCTR193	(CAN_MO193_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO193_CTR_STAT.
* To use register names with standard convension, please use CAN_MO193_CTR_STAT.
*/
#define	CAN_MOSTAT193	(CAN_MO193_CTR_STAT)

/** \\brief  2834, Message Object  Data Register High */
#define CAN_MO193_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A834u)

/** Alias (User Manual Name) for CAN_MO193_DATAH.
* To use register names with standard convension, please use CAN_MO193_DATAH.
*/
#define	CAN_MODATAH193	(CAN_MO193_DATAH)

/** \\brief  2830, Message Object  Data Register Low */
#define CAN_MO193_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A830u)

/** Alias (User Manual Name) for CAN_MO193_DATAL.
* To use register names with standard convension, please use CAN_MO193_DATAL.
*/
#define	CAN_MODATAL193	(CAN_MO193_DATAL)

/** \\brief  2820, Message Object  Function Control Register */
#define CAN_MO193_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A820u)

/** Alias (User Manual Name) for CAN_MO193_FCR.
* To use register names with standard convension, please use CAN_MO193_FCR.
*/
#define	CAN_MOFCR193	(CAN_MO193_FCR)

/** \\brief  2824, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO193_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A824u)

/** Alias (User Manual Name) for CAN_MO193_FGPR.
* To use register names with standard convension, please use CAN_MO193_FGPR.
*/
#define	CAN_MOFGPR193	(CAN_MO193_FGPR)

/** \\brief  2828, Message Object  Interrupt Pointer Register */
#define CAN_MO193_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A828u)

/** Alias (User Manual Name) for CAN_MO193_IPR.
* To use register names with standard convension, please use CAN_MO193_IPR.
*/
#define	CAN_MOIPR193	(CAN_MO193_IPR)

/** \\brief  284C, Message Object  Acceptance Mask Register */
#define CAN_MO194_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A84Cu)

/** Alias (User Manual Name) for CAN_MO194_AMR.
* To use register names with standard convension, please use CAN_MO194_AMR.
*/
#define	CAN_MOAMR194	(CAN_MO194_AMR)

/** \\brief  2858, Message Object  Arbitration Register */
#define CAN_MO194_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A858u)

