summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO194_AR.
* To use register names with standard convension, please use CAN_MO194_AR.
*/
#define	CAN_MOAR194	(CAN_MO194_AR)

/** \\brief  285C, Message Object  Control Register */
#define CAN_MO194_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A85Cu)

/** Alias (User Manual Name) for CAN_MO194_CTR_STAT.
* To use register names with standard convension, please use CAN_MO194_CTR_STAT.
*/
#define	CAN_MOCTR194	(CAN_MO194_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO194_CTR_STAT.
* To use register names with standard convension, please use CAN_MO194_CTR_STAT.
*/
#define	CAN_MOSTAT194	(CAN_MO194_CTR_STAT)

/** \\brief  2854, Message Object  Data Register High */
#define CAN_MO194_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A854u)

/** Alias (User Manual Name) for CAN_MO194_DATAH.
* To use register names with standard convension, please use CAN_MO194_DATAH.
*/
#define	CAN_MODATAH194	(CAN_MO194_DATAH)

/** \\brief  2850, Message Object  Data Register Low */
#define CAN_MO194_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A850u)

/** Alias (User Manual Name) for CAN_MO194_DATAL.
* To use register names with standard convension, please use CAN_MO194_DATAL.
*/
#define	CAN_MODATAL194	(CAN_MO194_DATAL)

/** \\brief  2840, Message Object  Function Control Register */
#define CAN_MO194_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A840u)

/** Alias (User Manual Name) for CAN_MO194_FCR.
* To use register names with standard convension, please use CAN_MO194_FCR.
*/
#define	CAN_MOFCR194	(CAN_MO194_FCR)

/** \\brief  2844, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO194_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A844u)

/** Alias (User Manual Name) for CAN_MO194_FGPR.
* To use register names with standard convension, please use CAN_MO194_FGPR.
*/
#define	CAN_MOFGPR194	(CAN_MO194_FGPR)

/** \\brief  2848, Message Object  Interrupt Pointer Register */
#define CAN_MO194_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A848u)

/** Alias (User Manual Name) for CAN_MO194_IPR.
* To use register names with standard convension, please use CAN_MO194_IPR.
*/
#define	CAN_MOIPR194	(CAN_MO194_IPR)

/** \\brief  286C, Message Object  Acceptance Mask Register */
#define CAN_MO195_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A86Cu)

/** Alias (User Manual Name) for CAN_MO195_AMR.
* To use register names with standard convension, please use CAN_MO195_AMR.
*/
#define	CAN_MOAMR195	(CAN_MO195_AMR)

/** \\brief  2878, Message Object  Arbitration Register */
#define CAN_MO195_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A878u)

/** Alias (User Manual Name) for CAN_MO195_AR.
* To use register names with standard convension, please use CAN_MO195_AR.
*/
#define	CAN_MOAR195	(CAN_MO195_AR)

/** \\brief  287C, Message Object  Control Register */
#define CAN_MO195_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A87Cu)

/** Alias (User Manual Name) for CAN_MO195_CTR_STAT.
* To use register names with standard convension, please use CAN_MO195_CTR_STAT.
*/
#define	CAN_MOCTR195	(CAN_MO195_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO195_CTR_STAT.
* To use register names with standard convension, please use CAN_MO195_CTR_STAT.
*/
#define	CAN_MOSTAT195	(CAN_MO195_CTR_STAT)

/** \\brief  2874, Message Object  Data Register High */
#define CAN_MO195_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A874u)

/** Alias (User Manual Name) for CAN_MO195_DATAH.
* To use register names with standard convension, please use CAN_MO195_DATAH.
*/
#define	CAN_MODATAH195	(CAN_MO195_DATAH)

/** \\brief  2870, Message Object  Data Register Low */
#define CAN_MO195_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A870u)

/** Alias (User Manual Name) for CAN_MO195_DATAL.
* To use register names with standard convension, please use CAN_MO195_DATAL.
*/
#define	CAN_MODATAL195	(CAN_MO195_DATAL)

/** \\brief  2860, Message Object  Function Control Register */
#define CAN_MO195_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A860u)

/** Alias (User Manual Name) for CAN_MO195_FCR.
* To use register names with standard convension, please use CAN_MO195_FCR.
*/
#define	CAN_MOFCR195	(CAN_MO195_FCR)

/** \\brief  2864, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO195_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A864u)

/** Alias (User Manual Name) for CAN_MO195_FGPR.
* To use register names with standard convension, please use CAN_MO195_FGPR.
*/
#define	CAN_MOFGPR195	(CAN_MO195_FGPR)

/** \\brief  2868, Message Object  Interrupt Pointer Register */
#define CAN_MO195_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A868u)

/** Alias (User Manual Name) for CAN_MO195_IPR.
* To use register names with standard convension, please use CAN_MO195_IPR.
*/
#define	CAN_MOIPR195	(CAN_MO195_IPR)

/** \\brief  288C, Message Object  Acceptance Mask Register */
#define CAN_MO196_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A88Cu)

/** Alias (User Manual Name) for CAN_MO196_AMR.
* To use register names with standard convension, please use CAN_MO196_AMR.
*/
#define	CAN_MOAMR196	(CAN_MO196_AMR)

/** \\brief  2898, Message Object  Arbitration Register */
#define CAN_MO196_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A898u)

/** Alias (User Manual Name) for CAN_MO196_AR.
* To use register names with standard convension, please use CAN_MO196_AR.
*/
#define	CAN_MOAR196	(CAN_MO196_AR)

/** \\brief  289C, Message Object  Control Register */
#define CAN_MO196_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A89Cu)

/** Alias (User Manual Name) for CAN_MO196_CTR_STAT.
* To use register names with standard convension, please use CAN_MO196_CTR_STAT.
*/
#define	CAN_MOCTR196	(CAN_MO196_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO196_CTR_STAT.
* To use register names with standard convension, please use CAN_MO196_CTR_STAT.
*/
#define	CAN_MOSTAT196	(CAN_MO196_CTR_STAT)

