summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_reg.h
/** \\brief  2894, Message Object  Data Register High */
#define CAN_MO196_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A894u)

/** Alias (User Manual Name) for CAN_MO196_DATAH.
* To use register names with standard convension, please use CAN_MO196_DATAH.
*/
#define	CAN_MODATAH196	(CAN_MO196_DATAH)

/** \\brief  2890, Message Object  Data Register Low */
#define CAN_MO196_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A890u)

/** Alias (User Manual Name) for CAN_MO196_DATAL.
* To use register names with standard convension, please use CAN_MO196_DATAL.
*/
#define	CAN_MODATAL196	(CAN_MO196_DATAL)

/** \\brief  2880, Message Object  Function Control Register */
#define CAN_MO196_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A880u)

/** Alias (User Manual Name) for CAN_MO196_FCR.
* To use register names with standard convension, please use CAN_MO196_FCR.
*/
#define	CAN_MOFCR196	(CAN_MO196_FCR)

/** \\brief  2884, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO196_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A884u)

/** Alias (User Manual Name) for CAN_MO196_FGPR.
* To use register names with standard convension, please use CAN_MO196_FGPR.
*/
#define	CAN_MOFGPR196	(CAN_MO196_FGPR)

/** \\brief  2888, Message Object  Interrupt Pointer Register */
#define CAN_MO196_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A888u)

/** Alias (User Manual Name) for CAN_MO196_IPR.
* To use register names with standard convension, please use CAN_MO196_IPR.
*/
#define	CAN_MOIPR196	(CAN_MO196_IPR)

/** \\brief  28AC, Message Object  Acceptance Mask Register */
#define CAN_MO197_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A8ACu)

/** Alias (User Manual Name) for CAN_MO197_AMR.
* To use register names with standard convension, please use CAN_MO197_AMR.
*/
#define	CAN_MOAMR197	(CAN_MO197_AMR)

/** \\brief  28B8, Message Object  Arbitration Register */
#define CAN_MO197_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A8B8u)

/** Alias (User Manual Name) for CAN_MO197_AR.
* To use register names with standard convension, please use CAN_MO197_AR.
*/
#define	CAN_MOAR197	(CAN_MO197_AR)

/** \\brief  28BC, Message Object  Control Register */
#define CAN_MO197_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A8BCu)

/** Alias (User Manual Name) for CAN_MO197_CTR_STAT.
* To use register names with standard convension, please use CAN_MO197_CTR_STAT.
*/
#define	CAN_MOSTAT197	(CAN_MO197_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO197_CTR_STAT.
* To use register names with standard convension, please use CAN_MO197_CTR_STAT.
*/
#define	CAN_MOCTR197	(CAN_MO197_CTR_STAT)

/** \\brief  28B4, Message Object  Data Register High */
#define CAN_MO197_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A8B4u)

/** Alias (User Manual Name) for CAN_MO197_DATAH.
* To use register names with standard convension, please use CAN_MO197_DATAH.
*/
#define	CAN_MODATAH197	(CAN_MO197_DATAH)

/** \\brief  28B0, Message Object  Data Register Low */
#define CAN_MO197_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A8B0u)

/** Alias (User Manual Name) for CAN_MO197_DATAL.
* To use register names with standard convension, please use CAN_MO197_DATAL.
*/
#define	CAN_MODATAL197	(CAN_MO197_DATAL)

/** \\brief  28A0, Message Object  Function Control Register */
#define CAN_MO197_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A8A0u)

/** Alias (User Manual Name) for CAN_MO197_FCR.
* To use register names with standard convension, please use CAN_MO197_FCR.
*/
#define	CAN_MOFCR197	(CAN_MO197_FCR)

/** \\brief  28A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO197_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A8A4u)

/** Alias (User Manual Name) for CAN_MO197_FGPR.
* To use register names with standard convension, please use CAN_MO197_FGPR.
*/
#define	CAN_MOFGPR197	(CAN_MO197_FGPR)

/** \\brief  28A8, Message Object  Interrupt Pointer Register */
#define CAN_MO197_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A8A8u)

/** Alias (User Manual Name) for CAN_MO197_IPR.
* To use register names with standard convension, please use CAN_MO197_IPR.
*/
#define	CAN_MOIPR197	(CAN_MO197_IPR)

/** \\brief  28CC, Message Object  Acceptance Mask Register */
#define CAN_MO198_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A8CCu)

/** Alias (User Manual Name) for CAN_MO198_AMR.
* To use register names with standard convension, please use CAN_MO198_AMR.
*/
#define	CAN_MOAMR198	(CAN_MO198_AMR)

/** \\brief  28D8, Message Object  Arbitration Register */
#define CAN_MO198_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A8D8u)

/** Alias (User Manual Name) for CAN_MO198_AR.
* To use register names with standard convension, please use CAN_MO198_AR.
*/
#define	CAN_MOAR198	(CAN_MO198_AR)

/** \\brief  28DC, Message Object  Control Register */
#define CAN_MO198_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A8DCu)

/** Alias (User Manual Name) for CAN_MO198_CTR_STAT.
* To use register names with standard convension, please use CAN_MO198_CTR_STAT.
*/
#define	CAN_MOSTAT198	(CAN_MO198_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO198_CTR_STAT.
* To use register names with standard convension, please use CAN_MO198_CTR_STAT.
*/
#define	CAN_MOCTR198	(CAN_MO198_CTR_STAT)

/** \\brief  28D4, Message Object  Data Register High */
#define CAN_MO198_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A8D4u)

/** Alias (User Manual Name) for CAN_MO198_DATAH.
* To use register names with standard convension, please use CAN_MO198_DATAH.
*/
#define	CAN_MODATAH198	(CAN_MO198_DATAH)

/** \\brief  28D0, Message Object  Data Register Low */
#define CAN_MO198_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A8D0u)

/** Alias (User Manual Name) for CAN_MO198_DATAL.
* To use register names with standard convension, please use CAN_MO198_DATAL.
*/
#define	CAN_MODATAL198	(CAN_MO198_DATAL)

/** \\brief  28C0, Message Object  Function Control Register */
#define CAN_MO198_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A8C0u)

/** Alias (User Manual Name) for CAN_MO198_FCR.
* To use register names with standard convension, please use CAN_MO198_FCR.
*/
#define	CAN_MOFCR198	(CAN_MO198_FCR)

/** \\brief  28C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO198_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A8C4u)

