summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO1_CTR_STAT.
* To use register names with standard convension, please use CAN_MO1_CTR_STAT.
*/
#define	CAN_MOCTR1	(CAN_MO1_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO1_CTR_STAT.
* To use register names with standard convension, please use CAN_MO1_CTR_STAT.
*/
#define	CAN_MOSTAT1	(CAN_MO1_CTR_STAT)

/** \\brief  1034, Message Object  Data Register High */
#define CAN_MO1_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019034u)

/** Alias (User Manual Name) for CAN_MO1_DATAH.
* To use register names with standard convension, please use CAN_MO1_DATAH.
*/
#define	CAN_MODATAH1	(CAN_MO1_DATAH)

/** \\brief  1030, Message Object  Data Register Low */
#define CAN_MO1_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019030u)

/** Alias (User Manual Name) for CAN_MO1_DATAL.
* To use register names with standard convension, please use CAN_MO1_DATAL.
*/
#define	CAN_MODATAL1	(CAN_MO1_DATAL)

/** \\brief  1020, Message Object  Function Control Register */
#define CAN_MO1_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019020u)

/** Alias (User Manual Name) for CAN_MO1_FCR.
* To use register names with standard convension, please use CAN_MO1_FCR.
*/
#define	CAN_MOFCR1	(CAN_MO1_FCR)

/** \\brief  1024, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO1_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019024u)

/** Alias (User Manual Name) for CAN_MO1_FGPR.
* To use register names with standard convension, please use CAN_MO1_FGPR.
*/
#define	CAN_MOFGPR1	(CAN_MO1_FGPR)

/** \\brief  1028, Message Object  Interrupt Pointer Register */
#define CAN_MO1_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019028u)

/** Alias (User Manual Name) for CAN_MO1_IPR.
* To use register names with standard convension, please use CAN_MO1_IPR.
*/
#define	CAN_MOIPR1	(CAN_MO1_IPR)

/** \\brief  290C, Message Object  Acceptance Mask Register */
#define CAN_MO200_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A90Cu)

/** Alias (User Manual Name) for CAN_MO200_AMR.
* To use register names with standard convension, please use CAN_MO200_AMR.
*/
#define	CAN_MOAMR200	(CAN_MO200_AMR)

/** \\brief  2918, Message Object  Arbitration Register */
#define CAN_MO200_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A918u)

/** Alias (User Manual Name) for CAN_MO200_AR.
* To use register names with standard convension, please use CAN_MO200_AR.
*/
#define	CAN_MOAR200	(CAN_MO200_AR)

/** \\brief  291C, Message Object  Control Register */
#define CAN_MO200_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A91Cu)

/** Alias (User Manual Name) for CAN_MO200_CTR_STAT.
* To use register names with standard convension, please use CAN_MO200_CTR_STAT.
*/
#define	CAN_MOSTAT200	(CAN_MO200_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO200_CTR_STAT.
* To use register names with standard convension, please use CAN_MO200_CTR_STAT.
*/
#define	CAN_MOCTR200	(CAN_MO200_CTR_STAT)

/** \\brief  2914, Message Object  Data Register High */
#define CAN_MO200_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A914u)

/** Alias (User Manual Name) for CAN_MO200_DATAH.
* To use register names with standard convension, please use CAN_MO200_DATAH.
*/
#define	CAN_MODATAH200	(CAN_MO200_DATAH)

/** \\brief  2910, Message Object  Data Register Low */
#define CAN_MO200_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A910u)

/** Alias (User Manual Name) for CAN_MO200_DATAL.
* To use register names with standard convension, please use CAN_MO200_DATAL.
*/
#define	CAN_MODATAL200	(CAN_MO200_DATAL)

/** \\brief  2900, Message Object  Function Control Register */
#define CAN_MO200_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A900u)

/** Alias (User Manual Name) for CAN_MO200_FCR.
* To use register names with standard convension, please use CAN_MO200_FCR.
*/
#define	CAN_MOFCR200	(CAN_MO200_FCR)

/** \\brief  2904, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO200_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A904u)

/** Alias (User Manual Name) for CAN_MO200_FGPR.
* To use register names with standard convension, please use CAN_MO200_FGPR.
*/
#define	CAN_MOFGPR200	(CAN_MO200_FGPR)

/** \\brief  2908, Message Object  Interrupt Pointer Register */
#define CAN_MO200_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A908u)

/** Alias (User Manual Name) for CAN_MO200_IPR.
* To use register names with standard convension, please use CAN_MO200_IPR.
*/
#define	CAN_MOIPR200	(CAN_MO200_IPR)

/** \\brief  292C, Message Object  Acceptance Mask Register */
#define CAN_MO201_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A92Cu)

/** Alias (User Manual Name) for CAN_MO201_AMR.
* To use register names with standard convension, please use CAN_MO201_AMR.
*/
#define	CAN_MOAMR201	(CAN_MO201_AMR)

/** \\brief  2938, Message Object  Arbitration Register */
#define CAN_MO201_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A938u)

/** Alias (User Manual Name) for CAN_MO201_AR.
* To use register names with standard convension, please use CAN_MO201_AR.
*/
#define	CAN_MOAR201	(CAN_MO201_AR)

/** \\brief  293C, Message Object  Control Register */
#define CAN_MO201_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A93Cu)

/** Alias (User Manual Name) for CAN_MO201_CTR_STAT.
* To use register names with standard convension, please use CAN_MO201_CTR_STAT.
*/
#define	CAN_MOSTAT201	(CAN_MO201_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO201_CTR_STAT.
* To use register names with standard convension, please use CAN_MO201_CTR_STAT.
*/
#define	CAN_MOCTR201	(CAN_MO201_CTR_STAT)

/** \\brief  2934, Message Object  Data Register High */
#define CAN_MO201_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A934u)

/** Alias (User Manual Name) for CAN_MO201_DATAH.
* To use register names with standard convension, please use CAN_MO201_DATAH.
*/
#define	CAN_MODATAH201	(CAN_MO201_DATAH)

/** \\brief  2930, Message Object  Data Register Low */
#define CAN_MO201_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A930u)

/** Alias (User Manual Name) for CAN_MO201_DATAL.
* To use register names with standard convension, please use CAN_MO201_DATAL.
*/
#define	CAN_MODATAL201	(CAN_MO201_DATAL)

/** \\brief  2920, Message Object  Function Control Register */
#define CAN_MO201_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A920u)

/** Alias (User Manual Name) for CAN_MO201_FCR.
* To use register names with standard convension, please use CAN_MO201_FCR.
*/
#define	CAN_MOFCR201	(CAN_MO201_FCR)

