summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_reg.h
/** \\brief  2984, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO204_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A984u)

/** Alias (User Manual Name) for CAN_MO204_FGPR.
* To use register names with standard convension, please use CAN_MO204_FGPR.
*/
#define	CAN_MOFGPR204	(CAN_MO204_FGPR)

/** \\brief  2988, Message Object  Interrupt Pointer Register */
#define CAN_MO204_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A988u)

/** Alias (User Manual Name) for CAN_MO204_IPR.
* To use register names with standard convension, please use CAN_MO204_IPR.
*/
#define	CAN_MOIPR204	(CAN_MO204_IPR)

/** \\brief  29AC, Message Object  Acceptance Mask Register */
#define CAN_MO205_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A9ACu)

/** Alias (User Manual Name) for CAN_MO205_AMR.
* To use register names with standard convension, please use CAN_MO205_AMR.
*/
#define	CAN_MOAMR205	(CAN_MO205_AMR)

/** \\brief  29B8, Message Object  Arbitration Register */
#define CAN_MO205_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A9B8u)

/** Alias (User Manual Name) for CAN_MO205_AR.
* To use register names with standard convension, please use CAN_MO205_AR.
*/
#define	CAN_MOAR205	(CAN_MO205_AR)

/** \\brief  29BC, Message Object  Control Register */
#define CAN_MO205_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A9BCu)

/** Alias (User Manual Name) for CAN_MO205_CTR_STAT.
* To use register names with standard convension, please use CAN_MO205_CTR_STAT.
*/
#define	CAN_MOSTAT205	(CAN_MO205_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO205_CTR_STAT.
* To use register names with standard convension, please use CAN_MO205_CTR_STAT.
*/
#define	CAN_MOCTR205	(CAN_MO205_CTR_STAT)

/** \\brief  29B4, Message Object  Data Register High */
#define CAN_MO205_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A9B4u)

/** Alias (User Manual Name) for CAN_MO205_DATAH.
* To use register names with standard convension, please use CAN_MO205_DATAH.
*/
#define	CAN_MODATAH205	(CAN_MO205_DATAH)

/** \\brief  29B0, Message Object  Data Register Low */
#define CAN_MO205_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A9B0u)

/** Alias (User Manual Name) for CAN_MO205_DATAL.
* To use register names with standard convension, please use CAN_MO205_DATAL.
*/
#define	CAN_MODATAL205	(CAN_MO205_DATAL)

/** \\brief  29A0, Message Object  Function Control Register */
#define CAN_MO205_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A9A0u)

/** Alias (User Manual Name) for CAN_MO205_FCR.
* To use register names with standard convension, please use CAN_MO205_FCR.
*/
#define	CAN_MOFCR205	(CAN_MO205_FCR)

/** \\brief  29A4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO205_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A9A4u)

/** Alias (User Manual Name) for CAN_MO205_FGPR.
* To use register names with standard convension, please use CAN_MO205_FGPR.
*/
#define	CAN_MOFGPR205	(CAN_MO205_FGPR)

/** \\brief  29A8, Message Object  Interrupt Pointer Register */
#define CAN_MO205_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A9A8u)

/** Alias (User Manual Name) for CAN_MO205_IPR.
* To use register names with standard convension, please use CAN_MO205_IPR.
*/
#define	CAN_MOIPR205	(CAN_MO205_IPR)

/** \\brief  29CC, Message Object  Acceptance Mask Register */
#define CAN_MO206_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001A9CCu)

/** Alias (User Manual Name) for CAN_MO206_AMR.
* To use register names with standard convension, please use CAN_MO206_AMR.
*/
#define	CAN_MOAMR206	(CAN_MO206_AMR)

/** \\brief  29D8, Message Object  Arbitration Register */
#define CAN_MO206_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001A9D8u)

/** Alias (User Manual Name) for CAN_MO206_AR.
* To use register names with standard convension, please use CAN_MO206_AR.
*/
#define	CAN_MOAR206	(CAN_MO206_AR)

/** \\brief  29DC, Message Object  Control Register */
#define CAN_MO206_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001A9DCu)

/** Alias (User Manual Name) for CAN_MO206_CTR_STAT.
* To use register names with standard convension, please use CAN_MO206_CTR_STAT.
*/
#define	CAN_MOSTAT206	(CAN_MO206_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO206_CTR_STAT.
* To use register names with standard convension, please use CAN_MO206_CTR_STAT.
*/
#define	CAN_MOCTR206	(CAN_MO206_CTR_STAT)

/** \\brief  29D4, Message Object  Data Register High */
#define CAN_MO206_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001A9D4u)

/** Alias (User Manual Name) for CAN_MO206_DATAH.
* To use register names with standard convension, please use CAN_MO206_DATAH.
*/
#define	CAN_MODATAH206	(CAN_MO206_DATAH)

/** \\brief  29D0, Message Object  Data Register Low */
#define CAN_MO206_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001A9D0u)

/** Alias (User Manual Name) for CAN_MO206_DATAL.
* To use register names with standard convension, please use CAN_MO206_DATAL.
*/
#define	CAN_MODATAL206	(CAN_MO206_DATAL)

/** \\brief  29C0, Message Object  Function Control Register */
#define CAN_MO206_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001A9C0u)

/** Alias (User Manual Name) for CAN_MO206_FCR.
* To use register names with standard convension, please use CAN_MO206_FCR.
*/
#define	CAN_MOFCR206	(CAN_MO206_FCR)

/** \\brief  29C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO206_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001A9C4u)

/** Alias (User Manual Name) for CAN_MO206_FGPR.
* To use register names with standard convension, please use CAN_MO206_FGPR.
*/
#define	CAN_MOFGPR206	(CAN_MO206_FGPR)

/** \\brief  29C8, Message Object  Interrupt Pointer Register */
#define CAN_MO206_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001A9C8u)

/** Alias (User Manual Name) for CAN_MO206_IPR.
* To use register names with standard convension, please use CAN_MO206_IPR.
*/
#define	CAN_MOIPR206	(CAN_MO206_IPR)

