summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO221_FGPR.
* To use register names with standard convension, please use CAN_MO221_FGPR.
*/
#define	CAN_MOFGPR221	(CAN_MO221_FGPR)

/** \\brief  2BA8, Message Object  Interrupt Pointer Register */
#define CAN_MO221_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001ABA8u)

/** Alias (User Manual Name) for CAN_MO221_IPR.
* To use register names with standard convension, please use CAN_MO221_IPR.
*/
#define	CAN_MOIPR221	(CAN_MO221_IPR)

/** \\brief  2BCC, Message Object  Acceptance Mask Register */
#define CAN_MO222_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001ABCCu)

/** Alias (User Manual Name) for CAN_MO222_AMR.
* To use register names with standard convension, please use CAN_MO222_AMR.
*/
#define	CAN_MOAMR222	(CAN_MO222_AMR)

/** \\brief  2BD8, Message Object  Arbitration Register */
#define CAN_MO222_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001ABD8u)

/** Alias (User Manual Name) for CAN_MO222_AR.
* To use register names with standard convension, please use CAN_MO222_AR.
*/
#define	CAN_MOAR222	(CAN_MO222_AR)

/** \\brief  2BDC, Message Object  Control Register */
#define CAN_MO222_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001ABDCu)

/** Alias (User Manual Name) for CAN_MO222_CTR_STAT.
* To use register names with standard convension, please use CAN_MO222_CTR_STAT.
*/
#define	CAN_MOSTAT222	(CAN_MO222_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO222_CTR_STAT.
* To use register names with standard convension, please use CAN_MO222_CTR_STAT.
*/
#define	CAN_MOCTR222	(CAN_MO222_CTR_STAT)

/** \\brief  2BD4, Message Object  Data Register High */
#define CAN_MO222_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001ABD4u)

/** Alias (User Manual Name) for CAN_MO222_DATAH.
* To use register names with standard convension, please use CAN_MO222_DATAH.
*/
#define	CAN_MODATAH222	(CAN_MO222_DATAH)

/** \\brief  2BD0, Message Object  Data Register Low */
#define CAN_MO222_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001ABD0u)

/** Alias (User Manual Name) for CAN_MO222_DATAL.
* To use register names with standard convension, please use CAN_MO222_DATAL.
*/
#define	CAN_MODATAL222	(CAN_MO222_DATAL)

/** \\brief  2BC0, Message Object  Function Control Register */
#define CAN_MO222_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001ABC0u)

/** Alias (User Manual Name) for CAN_MO222_FCR.
* To use register names with standard convension, please use CAN_MO222_FCR.
*/
#define	CAN_MOFCR222	(CAN_MO222_FCR)

/** \\brief  2BC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO222_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001ABC4u)

/** Alias (User Manual Name) for CAN_MO222_FGPR.
* To use register names with standard convension, please use CAN_MO222_FGPR.
*/
#define	CAN_MOFGPR222	(CAN_MO222_FGPR)

/** \\brief  2BC8, Message Object  Interrupt Pointer Register */
#define CAN_MO222_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001ABC8u)

/** Alias (User Manual Name) for CAN_MO222_IPR.
* To use register names with standard convension, please use CAN_MO222_IPR.
*/
#define	CAN_MOIPR222	(CAN_MO222_IPR)

/** \\brief  2BEC, Message Object  Acceptance Mask Register */
#define CAN_MO223_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001ABECu)

/** Alias (User Manual Name) for CAN_MO223_AMR.
* To use register names with standard convension, please use CAN_MO223_AMR.
*/
#define	CAN_MOAMR223	(CAN_MO223_AMR)

/** \\brief  2BF8, Message Object  Arbitration Register */
#define CAN_MO223_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001ABF8u)

/** Alias (User Manual Name) for CAN_MO223_AR.
* To use register names with standard convension, please use CAN_MO223_AR.
*/
#define	CAN_MOAR223	(CAN_MO223_AR)

/** \\brief  2BFC, Message Object  Control Register */
#define CAN_MO223_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001ABFCu)

/** Alias (User Manual Name) for CAN_MO223_CTR_STAT.
* To use register names with standard convension, please use CAN_MO223_CTR_STAT.
*/
#define	CAN_MOSTAT223	(CAN_MO223_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO223_CTR_STAT.
* To use register names with standard convension, please use CAN_MO223_CTR_STAT.
*/
#define	CAN_MOCTR223	(CAN_MO223_CTR_STAT)

/** \\brief  2BF4, Message Object  Data Register High */
#define CAN_MO223_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001ABF4u)

/** Alias (User Manual Name) for CAN_MO223_DATAH.
* To use register names with standard convension, please use CAN_MO223_DATAH.
*/
#define	CAN_MODATAH223	(CAN_MO223_DATAH)

/** \\brief  2BF0, Message Object  Data Register Low */
#define CAN_MO223_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001ABF0u)

/** Alias (User Manual Name) for CAN_MO223_DATAL.
* To use register names with standard convension, please use CAN_MO223_DATAL.
*/
#define	CAN_MODATAL223	(CAN_MO223_DATAL)

/** \\brief  2BE0, Message Object  Function Control Register */
#define CAN_MO223_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001ABE0u)

/** Alias (User Manual Name) for CAN_MO223_FCR.
* To use register names with standard convension, please use CAN_MO223_FCR.
*/
#define	CAN_MOFCR223	(CAN_MO223_FCR)

/** \\brief  2BE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO223_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001ABE4u)

/** Alias (User Manual Name) for CAN_MO223_FGPR.
* To use register names with standard convension, please use CAN_MO223_FGPR.
*/
#define	CAN_MOFGPR223	(CAN_MO223_FGPR)

/** \\brief  2BE8, Message Object  Interrupt Pointer Register */
#define CAN_MO223_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001ABE8u)

/** Alias (User Manual Name) for CAN_MO223_IPR.
* To use register names with standard convension, please use CAN_MO223_IPR.
*/
#define	CAN_MOIPR223	(CAN_MO223_IPR)

/** \\brief  2C0C, Message Object  Acceptance Mask Register */
#define CAN_MO224_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AC0Cu)

/** Alias (User Manual Name) for CAN_MO224_AMR.
* To use register names with standard convension, please use CAN_MO224_AMR.
*/
#define	CAN_MOAMR224	(CAN_MO224_AMR)

/** \\brief  2C18, Message Object  Arbitration Register */
#define CAN_MO224_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AC18u)

/** Alias (User Manual Name) for CAN_MO224_AR.
* To use register names with standard convension, please use CAN_MO224_AR.
*/
#define	CAN_MOAR224	(CAN_MO224_AR)

