summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_reg.h
/** \\brief  2C1C, Message Object  Control Register */
#define CAN_MO224_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AC1Cu)

/** Alias (User Manual Name) for CAN_MO224_CTR_STAT.
* To use register names with standard convension, please use CAN_MO224_CTR_STAT.
*/
#define	CAN_MOSTAT224	(CAN_MO224_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO224_CTR_STAT.
* To use register names with standard convension, please use CAN_MO224_CTR_STAT.
*/
#define	CAN_MOCTR224	(CAN_MO224_CTR_STAT)

/** \\brief  2C14, Message Object  Data Register High */
#define CAN_MO224_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AC14u)

/** Alias (User Manual Name) for CAN_MO224_DATAH.
* To use register names with standard convension, please use CAN_MO224_DATAH.
*/
#define	CAN_MODATAH224	(CAN_MO224_DATAH)

/** \\brief  2C10, Message Object  Data Register Low */
#define CAN_MO224_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AC10u)

/** Alias (User Manual Name) for CAN_MO224_DATAL.
* To use register names with standard convension, please use CAN_MO224_DATAL.
*/
#define	CAN_MODATAL224	(CAN_MO224_DATAL)

/** \\brief  2C00, Message Object  Function Control Register */
#define CAN_MO224_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AC00u)

/** Alias (User Manual Name) for CAN_MO224_FCR.
* To use register names with standard convension, please use CAN_MO224_FCR.
*/
#define	CAN_MOFCR224	(CAN_MO224_FCR)

/** \\brief  2C04, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO224_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AC04u)

/** Alias (User Manual Name) for CAN_MO224_FGPR.
* To use register names with standard convension, please use CAN_MO224_FGPR.
*/
#define	CAN_MOFGPR224	(CAN_MO224_FGPR)

/** \\brief  2C08, Message Object  Interrupt Pointer Register */
#define CAN_MO224_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AC08u)

/** Alias (User Manual Name) for CAN_MO224_IPR.
* To use register names with standard convension, please use CAN_MO224_IPR.
*/
#define	CAN_MOIPR224	(CAN_MO224_IPR)

/** \\brief  2C2C, Message Object  Acceptance Mask Register */
#define CAN_MO225_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AC2Cu)

/** Alias (User Manual Name) for CAN_MO225_AMR.
* To use register names with standard convension, please use CAN_MO225_AMR.
*/
#define	CAN_MOAMR225	(CAN_MO225_AMR)

/** \\brief  2C38, Message Object  Arbitration Register */
#define CAN_MO225_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AC38u)

/** Alias (User Manual Name) for CAN_MO225_AR.
* To use register names with standard convension, please use CAN_MO225_AR.
*/
#define	CAN_MOAR225	(CAN_MO225_AR)

/** \\brief  2C3C, Message Object  Control Register */
#define CAN_MO225_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AC3Cu)

/** Alias (User Manual Name) for CAN_MO225_CTR_STAT.
* To use register names with standard convension, please use CAN_MO225_CTR_STAT.
*/
#define	CAN_MOSTAT225	(CAN_MO225_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO225_CTR_STAT.
* To use register names with standard convension, please use CAN_MO225_CTR_STAT.
*/
#define	CAN_MOCTR225	(CAN_MO225_CTR_STAT)

/** \\brief  2C34, Message Object  Data Register High */
#define CAN_MO225_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AC34u)

/** Alias (User Manual Name) for CAN_MO225_DATAH.
* To use register names with standard convension, please use CAN_MO225_DATAH.
*/
#define	CAN_MODATAH225	(CAN_MO225_DATAH)

/** \\brief  2C30, Message Object  Data Register Low */
#define CAN_MO225_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AC30u)

/** Alias (User Manual Name) for CAN_MO225_DATAL.
* To use register names with standard convension, please use CAN_MO225_DATAL.
*/
#define	CAN_MODATAL225	(CAN_MO225_DATAL)

/** \\brief  2C20, Message Object  Function Control Register */
#define CAN_MO225_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AC20u)

/** Alias (User Manual Name) for CAN_MO225_FCR.
* To use register names with standard convension, please use CAN_MO225_FCR.
*/
#define	CAN_MOFCR225	(CAN_MO225_FCR)

/** \\brief  2C24, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO225_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AC24u)

/** Alias (User Manual Name) for CAN_MO225_FGPR.
* To use register names with standard convension, please use CAN_MO225_FGPR.
*/
#define	CAN_MOFGPR225	(CAN_MO225_FGPR)

/** \\brief  2C28, Message Object  Interrupt Pointer Register */
#define CAN_MO225_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AC28u)

/** Alias (User Manual Name) for CAN_MO225_IPR.
* To use register names with standard convension, please use CAN_MO225_IPR.
*/
#define	CAN_MOIPR225	(CAN_MO225_IPR)

/** \\brief  2C4C, Message Object  Acceptance Mask Register */
#define CAN_MO226_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AC4Cu)

/** Alias (User Manual Name) for CAN_MO226_AMR.
* To use register names with standard convension, please use CAN_MO226_AMR.
*/
#define	CAN_MOAMR226	(CAN_MO226_AMR)

/** \\brief  2C58, Message Object  Arbitration Register */
#define CAN_MO226_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AC58u)

/** Alias (User Manual Name) for CAN_MO226_AR.
* To use register names with standard convension, please use CAN_MO226_AR.
*/
#define	CAN_MOAR226	(CAN_MO226_AR)

/** \\brief  2C5C, Message Object  Control Register */
#define CAN_MO226_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AC5Cu)

/** Alias (User Manual Name) for CAN_MO226_CTR_STAT.
* To use register names with standard convension, please use CAN_MO226_CTR_STAT.
*/
#define	CAN_MOSTAT226	(CAN_MO226_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO226_CTR_STAT.
* To use register names with standard convension, please use CAN_MO226_CTR_STAT.
*/
#define	CAN_MOCTR226	(CAN_MO226_CTR_STAT)

/** \\brief  2C54, Message Object  Data Register High */
#define CAN_MO226_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AC54u)

/** Alias (User Manual Name) for CAN_MO226_DATAH.
* To use register names with standard convension, please use CAN_MO226_DATAH.
*/
#define	CAN_MODATAH226	(CAN_MO226_DATAH)

/** \\brief  2C50, Message Object  Data Register Low */
#define CAN_MO226_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AC50u)

/** Alias (User Manual Name) for CAN_MO226_DATAL.
* To use register names with standard convension, please use CAN_MO226_DATAL.
*/
#define	CAN_MODATAL226	(CAN_MO226_DATAL)

/** \\brief  2C40, Message Object  Function Control Register */
#define CAN_MO226_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AC40u)

/** Alias (User Manual Name) for CAN_MO226_FCR.
* To use register names with standard convension, please use CAN_MO226_FCR.
*/
#define	CAN_MOFCR226	(CAN_MO226_FCR)

/** \\brief  2C44, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO226_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AC44u)

/** Alias (User Manual Name) for CAN_MO226_FGPR.
* To use register names with standard convension, please use CAN_MO226_FGPR.
*/
#define	CAN_MOFGPR226	(CAN_MO226_FGPR)

/** \\brief  2C48, Message Object  Interrupt Pointer Register */
#define CAN_MO226_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AC48u)

