summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO226_IPR.
* To use register names with standard convension, please use CAN_MO226_IPR.
*/
#define	CAN_MOIPR226	(CAN_MO226_IPR)

/** \\brief  2C6C, Message Object  Acceptance Mask Register */
#define CAN_MO227_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AC6Cu)

/** Alias (User Manual Name) for CAN_MO227_AMR.
* To use register names with standard convension, please use CAN_MO227_AMR.
*/
#define	CAN_MOAMR227	(CAN_MO227_AMR)

/** \\brief  2C78, Message Object  Arbitration Register */
#define CAN_MO227_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AC78u)

/** Alias (User Manual Name) for CAN_MO227_AR.
* To use register names with standard convension, please use CAN_MO227_AR.
*/
#define	CAN_MOAR227	(CAN_MO227_AR)

/** \\brief  2C7C, Message Object  Control Register */
#define CAN_MO227_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AC7Cu)

/** Alias (User Manual Name) for CAN_MO227_CTR_STAT.
* To use register names with standard convension, please use CAN_MO227_CTR_STAT.
*/
#define	CAN_MOSTAT227	(CAN_MO227_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO227_CTR_STAT.
* To use register names with standard convension, please use CAN_MO227_CTR_STAT.
*/
#define	CAN_MOCTR227	(CAN_MO227_CTR_STAT)

/** \\brief  2C74, Message Object  Data Register High */
#define CAN_MO227_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AC74u)

/** Alias (User Manual Name) for CAN_MO227_DATAH.
* To use register names with standard convension, please use CAN_MO227_DATAH.
*/
#define	CAN_MODATAH227	(CAN_MO227_DATAH)

/** \\brief  2C70, Message Object  Data Register Low */
#define CAN_MO227_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AC70u)

/** Alias (User Manual Name) for CAN_MO227_DATAL.
* To use register names with standard convension, please use CAN_MO227_DATAL.
*/
#define	CAN_MODATAL227	(CAN_MO227_DATAL)

/** \\brief  2C60, Message Object  Function Control Register */
#define CAN_MO227_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AC60u)

/** Alias (User Manual Name) for CAN_MO227_FCR.
* To use register names with standard convension, please use CAN_MO227_FCR.
*/
#define	CAN_MOFCR227	(CAN_MO227_FCR)

/** \\brief  2C64, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO227_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AC64u)

/** Alias (User Manual Name) for CAN_MO227_FGPR.
* To use register names with standard convension, please use CAN_MO227_FGPR.
*/
#define	CAN_MOFGPR227	(CAN_MO227_FGPR)

/** \\brief  2C68, Message Object  Interrupt Pointer Register */
#define CAN_MO227_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AC68u)

/** Alias (User Manual Name) for CAN_MO227_IPR.
* To use register names with standard convension, please use CAN_MO227_IPR.
*/
#define	CAN_MOIPR227	(CAN_MO227_IPR)

/** \\brief  2C8C, Message Object  Acceptance Mask Register */
#define CAN_MO228_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AC8Cu)

/** Alias (User Manual Name) for CAN_MO228_AMR.
* To use register names with standard convension, please use CAN_MO228_AMR.
*/
#define	CAN_MOAMR228	(CAN_MO228_AMR)

/** \\brief  2C98, Message Object  Arbitration Register */
#define CAN_MO228_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AC98u)

/** Alias (User Manual Name) for CAN_MO228_AR.
* To use register names with standard convension, please use CAN_MO228_AR.
*/
#define	CAN_MOAR228	(CAN_MO228_AR)

/** \\brief  2C9C, Message Object  Control Register */
#define CAN_MO228_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AC9Cu)

/** Alias (User Manual Name) for CAN_MO228_CTR_STAT.
* To use register names with standard convension, please use CAN_MO228_CTR_STAT.
*/
#define	CAN_MOSTAT228	(CAN_MO228_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO228_CTR_STAT.
* To use register names with standard convension, please use CAN_MO228_CTR_STAT.
*/
#define	CAN_MOCTR228	(CAN_MO228_CTR_STAT)

/** \\brief  2C94, Message Object  Data Register High */
#define CAN_MO228_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AC94u)

/** Alias (User Manual Name) for CAN_MO228_DATAH.
* To use register names with standard convension, please use CAN_MO228_DATAH.
*/
#define	CAN_MODATAH228	(CAN_MO228_DATAH)

/** \\brief  2C90, Message Object  Data Register Low */
#define CAN_MO228_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AC90u)

/** Alias (User Manual Name) for CAN_MO228_DATAL.
* To use register names with standard convension, please use CAN_MO228_DATAL.
*/
#define	CAN_MODATAL228	(CAN_MO228_DATAL)

/** \\brief  2C80, Message Object  Function Control Register */
#define CAN_MO228_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AC80u)

/** Alias (User Manual Name) for CAN_MO228_FCR.
* To use register names with standard convension, please use CAN_MO228_FCR.
*/
#define	CAN_MOFCR228	(CAN_MO228_FCR)

/** \\brief  2C84, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO228_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AC84u)

/** Alias (User Manual Name) for CAN_MO228_FGPR.
* To use register names with standard convension, please use CAN_MO228_FGPR.
*/
#define	CAN_MOFGPR228	(CAN_MO228_FGPR)

/** \\brief  2C88, Message Object  Interrupt Pointer Register */
#define CAN_MO228_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AC88u)

/** Alias (User Manual Name) for CAN_MO228_IPR.
* To use register names with standard convension, please use CAN_MO228_IPR.
*/
#define	CAN_MOIPR228	(CAN_MO228_IPR)

/** \\brief  2CAC, Message Object  Acceptance Mask Register */
#define CAN_MO229_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001ACACu)

/** Alias (User Manual Name) for CAN_MO229_AMR.
* To use register names with standard convension, please use CAN_MO229_AMR.
*/
#define	CAN_MOAMR229	(CAN_MO229_AMR)

/** \\brief  2CB8, Message Object  Arbitration Register */
#define CAN_MO229_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001ACB8u)

/** Alias (User Manual Name) for CAN_MO229_AR.
* To use register names with standard convension, please use CAN_MO229_AR.
*/
#define	CAN_MOAR229	(CAN_MO229_AR)

/** \\brief  2CBC, Message Object  Control Register */
#define CAN_MO229_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001ACBCu)

/** Alias (User Manual Name) for CAN_MO229_CTR_STAT.
* To use register names with standard convension, please use CAN_MO229_CTR_STAT.
*/
#define	CAN_MOSTAT229	(CAN_MO229_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO229_CTR_STAT.
* To use register names with standard convension, please use CAN_MO229_CTR_STAT.
*/
#define	CAN_MOCTR229	(CAN_MO229_CTR_STAT)

/** \\brief  2CB4, Message Object  Data Register High */
#define CAN_MO229_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001ACB4u)

/** Alias (User Manual Name) for CAN_MO229_DATAH.
* To use register names with standard convension, please use CAN_MO229_DATAH.
*/
#define	CAN_MODATAH229	(CAN_MO229_DATAH)

/** \\brief  2CB0, Message Object  Data Register Low */
#define CAN_MO229_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001ACB0u)

/** Alias (User Manual Name) for CAN_MO229_DATAL.
* To use register names with standard convension, please use CAN_MO229_DATAL.
*/
#define	CAN_MODATAL229	(CAN_MO229_DATAL)

