summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_reg.h
/** \\brief  2CA0, Message Object  Function Control Register */
#define CAN_MO229_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001ACA0u)

/** Alias (User Manual Name) for CAN_MO229_FCR.
* To use register names with standard convension, please use CAN_MO229_FCR.
*/
#define	CAN_MOFCR229	(CAN_MO229_FCR)

/** \\brief  2CA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO229_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001ACA4u)

/** Alias (User Manual Name) for CAN_MO229_FGPR.
* To use register names with standard convension, please use CAN_MO229_FGPR.
*/
#define	CAN_MOFGPR229	(CAN_MO229_FGPR)

/** \\brief  2CA8, Message Object  Interrupt Pointer Register */
#define CAN_MO229_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001ACA8u)

/** Alias (User Manual Name) for CAN_MO229_IPR.
* To use register names with standard convension, please use CAN_MO229_IPR.
*/
#define	CAN_MOIPR229	(CAN_MO229_IPR)

/** \\brief  12CC, Message Object  Acceptance Mask Register */
#define CAN_MO22_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF00192CCu)

/** Alias (User Manual Name) for CAN_MO22_AMR.
* To use register names with standard convension, please use CAN_MO22_AMR.
*/
#define	CAN_MOAMR22	(CAN_MO22_AMR)

/** \\brief  12D8, Message Object  Arbitration Register */
#define CAN_MO22_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF00192D8u)

/** Alias (User Manual Name) for CAN_MO22_AR.
* To use register names with standard convension, please use CAN_MO22_AR.
*/
#define	CAN_MOAR22	(CAN_MO22_AR)

/** \\brief  12DC, Message Object  Control Register */
#define CAN_MO22_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF00192DCu)

/** Alias (User Manual Name) for CAN_MO22_CTR_STAT.
* To use register names with standard convension, please use CAN_MO22_CTR_STAT.
*/
#define	CAN_MOSTAT22	(CAN_MO22_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO22_CTR_STAT.
* To use register names with standard convension, please use CAN_MO22_CTR_STAT.
*/
#define	CAN_MOCTR22	(CAN_MO22_CTR_STAT)

/** \\brief  12D4, Message Object  Data Register High */
#define CAN_MO22_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF00192D4u)

/** Alias (User Manual Name) for CAN_MO22_DATAH.
* To use register names with standard convension, please use CAN_MO22_DATAH.
*/
#define	CAN_MODATAH22	(CAN_MO22_DATAH)

/** \\brief  12D0, Message Object  Data Register Low */
#define CAN_MO22_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF00192D0u)

/** Alias (User Manual Name) for CAN_MO22_DATAL.
* To use register names with standard convension, please use CAN_MO22_DATAL.
*/
#define	CAN_MODATAL22	(CAN_MO22_DATAL)

/** \\brief  12C0, Message Object  Function Control Register */
#define CAN_MO22_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF00192C0u)

/** Alias (User Manual Name) for CAN_MO22_FCR.
* To use register names with standard convension, please use CAN_MO22_FCR.
*/
#define	CAN_MOFCR22	(CAN_MO22_FCR)

/** \\brief  12C4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO22_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF00192C4u)

/** Alias (User Manual Name) for CAN_MO22_FGPR.
* To use register names with standard convension, please use CAN_MO22_FGPR.
*/
#define	CAN_MOFGPR22	(CAN_MO22_FGPR)

/** \\brief  12C8, Message Object  Interrupt Pointer Register */
#define CAN_MO22_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF00192C8u)

/** Alias (User Manual Name) for CAN_MO22_IPR.
* To use register names with standard convension, please use CAN_MO22_IPR.
*/
#define	CAN_MOIPR22	(CAN_MO22_IPR)

/** \\brief  2CCC, Message Object  Acceptance Mask Register */
#define CAN_MO230_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001ACCCu)

/** Alias (User Manual Name) for CAN_MO230_AMR.
* To use register names with standard convension, please use CAN_MO230_AMR.
*/
#define	CAN_MOAMR230	(CAN_MO230_AMR)

/** \\brief  2CD8, Message Object  Arbitration Register */
#define CAN_MO230_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001ACD8u)

/** Alias (User Manual Name) for CAN_MO230_AR.
* To use register names with standard convension, please use CAN_MO230_AR.
*/
#define	CAN_MOAR230	(CAN_MO230_AR)

/** \\brief  2CDC, Message Object  Control Register */
#define CAN_MO230_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001ACDCu)

/** Alias (User Manual Name) for CAN_MO230_CTR_STAT.
* To use register names with standard convension, please use CAN_MO230_CTR_STAT.
*/
#define	CAN_MOCTR230	(CAN_MO230_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO230_CTR_STAT.
* To use register names with standard convension, please use CAN_MO230_CTR_STAT.
*/
#define	CAN_MOSTAT230	(CAN_MO230_CTR_STAT)

/** \\brief  2CD4, Message Object  Data Register High */
#define CAN_MO230_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001ACD4u)

/** Alias (User Manual Name) for CAN_MO230_DATAH.
* To use register names with standard convension, please use CAN_MO230_DATAH.
*/
#define	CAN_MODATAH230	(CAN_MO230_DATAH)

/** \\brief  2CD0, Message Object  Data Register Low */
#define CAN_MO230_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001ACD0u)

/** Alias (User Manual Name) for CAN_MO230_DATAL.
* To use register names with standard convension, please use CAN_MO230_DATAL.
*/
#define	CAN_MODATAL230	(CAN_MO230_DATAL)

/** \\brief  2CC0, Message Object  Function Control Register */
#define CAN_MO230_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001ACC0u)

/** Alias (User Manual Name) for CAN_MO230_FCR.
* To use register names with standard convension, please use CAN_MO230_FCR.
*/
#define	CAN_MOFCR230	(CAN_MO230_FCR)

/** \\brief  2CC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO230_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001ACC4u)

/** Alias (User Manual Name) for CAN_MO230_FGPR.
* To use register names with standard convension, please use CAN_MO230_FGPR.
*/
#define	CAN_MOFGPR230	(CAN_MO230_FGPR)

/** \\brief  2CC8, Message Object  Interrupt Pointer Register */
#define CAN_MO230_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001ACC8u)

/** Alias (User Manual Name) for CAN_MO230_IPR.
* To use register names with standard convension, please use CAN_MO230_IPR.
*/
#define	CAN_MOIPR230	(CAN_MO230_IPR)

/** \\brief  2CEC, Message Object  Acceptance Mask Register */
#define CAN_MO231_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001ACECu)

