summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO231_AMR.
* To use register names with standard convension, please use CAN_MO231_AMR.
*/
#define	CAN_MOAMR231	(CAN_MO231_AMR)

/** \\brief  2CF8, Message Object  Arbitration Register */
#define CAN_MO231_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001ACF8u)

/** Alias (User Manual Name) for CAN_MO231_AR.
* To use register names with standard convension, please use CAN_MO231_AR.
*/
#define	CAN_MOAR231	(CAN_MO231_AR)

/** \\brief  2CFC, Message Object  Control Register */
#define CAN_MO231_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001ACFCu)

/** Alias (User Manual Name) for CAN_MO231_CTR_STAT.
* To use register names with standard convension, please use CAN_MO231_CTR_STAT.
*/
#define	CAN_MOCTR231	(CAN_MO231_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO231_CTR_STAT.
* To use register names with standard convension, please use CAN_MO231_CTR_STAT.
*/
#define	CAN_MOSTAT231	(CAN_MO231_CTR_STAT)

/** \\brief  2CF4, Message Object  Data Register High */
#define CAN_MO231_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001ACF4u)

/** Alias (User Manual Name) for CAN_MO231_DATAH.
* To use register names with standard convension, please use CAN_MO231_DATAH.
*/
#define	CAN_MODATAH231	(CAN_MO231_DATAH)

/** \\brief  2CF0, Message Object  Data Register Low */
#define CAN_MO231_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001ACF0u)

/** Alias (User Manual Name) for CAN_MO231_DATAL.
* To use register names with standard convension, please use CAN_MO231_DATAL.
*/
#define	CAN_MODATAL231	(CAN_MO231_DATAL)

/** \\brief  2CE0, Message Object  Function Control Register */
#define CAN_MO231_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001ACE0u)

/** Alias (User Manual Name) for CAN_MO231_FCR.
* To use register names with standard convension, please use CAN_MO231_FCR.
*/
#define	CAN_MOFCR231	(CAN_MO231_FCR)

/** \\brief  2CE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO231_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001ACE4u)

/** Alias (User Manual Name) for CAN_MO231_FGPR.
* To use register names with standard convension, please use CAN_MO231_FGPR.
*/
#define	CAN_MOFGPR231	(CAN_MO231_FGPR)

/** \\brief  2CE8, Message Object  Interrupt Pointer Register */
#define CAN_MO231_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001ACE8u)

/** Alias (User Manual Name) for CAN_MO231_IPR.
* To use register names with standard convension, please use CAN_MO231_IPR.
*/
#define	CAN_MOIPR231	(CAN_MO231_IPR)

/** \\brief  2D0C, Message Object  Acceptance Mask Register */
#define CAN_MO232_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AD0Cu)

/** Alias (User Manual Name) for CAN_MO232_AMR.
* To use register names with standard convension, please use CAN_MO232_AMR.
*/
#define	CAN_MOAMR232	(CAN_MO232_AMR)

/** \\brief  2D18, Message Object  Arbitration Register */
#define CAN_MO232_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AD18u)

/** Alias (User Manual Name) for CAN_MO232_AR.
* To use register names with standard convension, please use CAN_MO232_AR.
*/
#define	CAN_MOAR232	(CAN_MO232_AR)

/** \\brief  2D1C, Message Object  Control Register */
#define CAN_MO232_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AD1Cu)

/** Alias (User Manual Name) for CAN_MO232_CTR_STAT.
* To use register names with standard convension, please use CAN_MO232_CTR_STAT.
*/
#define	CAN_MOCTR232	(CAN_MO232_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO232_CTR_STAT.
* To use register names with standard convension, please use CAN_MO232_CTR_STAT.
*/
#define	CAN_MOSTAT232	(CAN_MO232_CTR_STAT)

/** \\brief  2D14, Message Object  Data Register High */
#define CAN_MO232_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AD14u)

/** Alias (User Manual Name) for CAN_MO232_DATAH.
* To use register names with standard convension, please use CAN_MO232_DATAH.
*/
#define	CAN_MODATAH232	(CAN_MO232_DATAH)

/** \\brief  2D10, Message Object  Data Register Low */
#define CAN_MO232_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AD10u)

/** Alias (User Manual Name) for CAN_MO232_DATAL.
* To use register names with standard convension, please use CAN_MO232_DATAL.
*/
#define	CAN_MODATAL232	(CAN_MO232_DATAL)

/** \\brief  2D00, Message Object  Function Control Register */
#define CAN_MO232_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AD00u)

/** Alias (User Manual Name) for CAN_MO232_FCR.
* To use register names with standard convension, please use CAN_MO232_FCR.
*/
#define	CAN_MOFCR232	(CAN_MO232_FCR)

/** \\brief  2D04, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO232_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AD04u)

/** Alias (User Manual Name) for CAN_MO232_FGPR.
* To use register names with standard convension, please use CAN_MO232_FGPR.
*/
#define	CAN_MOFGPR232	(CAN_MO232_FGPR)

/** \\brief  2D08, Message Object  Interrupt Pointer Register */
#define CAN_MO232_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AD08u)

/** Alias (User Manual Name) for CAN_MO232_IPR.
* To use register names with standard convension, please use CAN_MO232_IPR.
*/
#define	CAN_MOIPR232	(CAN_MO232_IPR)

/** \\brief  2D2C, Message Object  Acceptance Mask Register */
#define CAN_MO233_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AD2Cu)

/** Alias (User Manual Name) for CAN_MO233_AMR.
* To use register names with standard convension, please use CAN_MO233_AMR.
*/
#define	CAN_MOAMR233	(CAN_MO233_AMR)

/** \\brief  2D38, Message Object  Arbitration Register */
#define CAN_MO233_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AD38u)

/** Alias (User Manual Name) for CAN_MO233_AR.
* To use register names with standard convension, please use CAN_MO233_AR.
*/
#define	CAN_MOAR233	(CAN_MO233_AR)

/** \\brief  2D3C, Message Object  Control Register */
#define CAN_MO233_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AD3Cu)

/** Alias (User Manual Name) for CAN_MO233_CTR_STAT.
* To use register names with standard convension, please use CAN_MO233_CTR_STAT.
*/
#define	CAN_MOCTR233	(CAN_MO233_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO233_CTR_STAT.
* To use register names with standard convension, please use CAN_MO233_CTR_STAT.
*/
#define	CAN_MOSTAT233	(CAN_MO233_CTR_STAT)

/** \\brief  2D34, Message Object  Data Register High */
#define CAN_MO233_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AD34u)

/** Alias (User Manual Name) for CAN_MO233_DATAH.
* To use register names with standard convension, please use CAN_MO233_DATAH.
*/
#define	CAN_MODATAH233	(CAN_MO233_DATAH)

/** \\brief  2D30, Message Object  Data Register Low */
#define CAN_MO233_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AD30u)

/** Alias (User Manual Name) for CAN_MO233_DATAL.
* To use register names with standard convension, please use CAN_MO233_DATAL.
*/
#define	CAN_MODATAL233	(CAN_MO233_DATAL)

