summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_reg.h
/** \\brief  2E4C, Message Object  Acceptance Mask Register */
#define CAN_MO242_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AE4Cu)

/** Alias (User Manual Name) for CAN_MO242_AMR.
* To use register names with standard convension, please use CAN_MO242_AMR.
*/
#define	CAN_MOAMR242	(CAN_MO242_AMR)

/** \\brief  2E58, Message Object  Arbitration Register */
#define CAN_MO242_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AE58u)

/** Alias (User Manual Name) for CAN_MO242_AR.
* To use register names with standard convension, please use CAN_MO242_AR.
*/
#define	CAN_MOAR242	(CAN_MO242_AR)

/** \\brief  2E5C, Message Object  Control Register */
#define CAN_MO242_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AE5Cu)

/** Alias (User Manual Name) for CAN_MO242_CTR_STAT.
* To use register names with standard convension, please use CAN_MO242_CTR_STAT.
*/
#define	CAN_MOSTAT242	(CAN_MO242_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO242_CTR_STAT.
* To use register names with standard convension, please use CAN_MO242_CTR_STAT.
*/
#define	CAN_MOCTR242	(CAN_MO242_CTR_STAT)

/** \\brief  2E54, Message Object  Data Register High */
#define CAN_MO242_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AE54u)

/** Alias (User Manual Name) for CAN_MO242_DATAH.
* To use register names with standard convension, please use CAN_MO242_DATAH.
*/
#define	CAN_MODATAH242	(CAN_MO242_DATAH)

/** \\brief  2E50, Message Object  Data Register Low */
#define CAN_MO242_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AE50u)

/** Alias (User Manual Name) for CAN_MO242_DATAL.
* To use register names with standard convension, please use CAN_MO242_DATAL.
*/
#define	CAN_MODATAL242	(CAN_MO242_DATAL)

/** \\brief  2E40, Message Object  Function Control Register */
#define CAN_MO242_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AE40u)

/** Alias (User Manual Name) for CAN_MO242_FCR.
* To use register names with standard convension, please use CAN_MO242_FCR.
*/
#define	CAN_MOFCR242	(CAN_MO242_FCR)

/** \\brief  2E44, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO242_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AE44u)

/** Alias (User Manual Name) for CAN_MO242_FGPR.
* To use register names with standard convension, please use CAN_MO242_FGPR.
*/
#define	CAN_MOFGPR242	(CAN_MO242_FGPR)

/** \\brief  2E48, Message Object  Interrupt Pointer Register */
#define CAN_MO242_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AE48u)

/** Alias (User Manual Name) for CAN_MO242_IPR.
* To use register names with standard convension, please use CAN_MO242_IPR.
*/
#define	CAN_MOIPR242	(CAN_MO242_IPR)

/** \\brief  2E6C, Message Object  Acceptance Mask Register */
#define CAN_MO243_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AE6Cu)

/** Alias (User Manual Name) for CAN_MO243_AMR.
* To use register names with standard convension, please use CAN_MO243_AMR.
*/
#define	CAN_MOAMR243	(CAN_MO243_AMR)

/** \\brief  2E78, Message Object  Arbitration Register */
#define CAN_MO243_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AE78u)

/** Alias (User Manual Name) for CAN_MO243_AR.
* To use register names with standard convension, please use CAN_MO243_AR.
*/
#define	CAN_MOAR243	(CAN_MO243_AR)

/** \\brief  2E7C, Message Object  Control Register */
#define CAN_MO243_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AE7Cu)

/** Alias (User Manual Name) for CAN_MO243_CTR_STAT.
* To use register names with standard convension, please use CAN_MO243_CTR_STAT.
*/
#define	CAN_MOSTAT243	(CAN_MO243_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO243_CTR_STAT.
* To use register names with standard convension, please use CAN_MO243_CTR_STAT.
*/
#define	CAN_MOCTR243	(CAN_MO243_CTR_STAT)

/** \\brief  2E74, Message Object  Data Register High */
#define CAN_MO243_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AE74u)

/** Alias (User Manual Name) for CAN_MO243_DATAH.
* To use register names with standard convension, please use CAN_MO243_DATAH.
*/
#define	CAN_MODATAH243	(CAN_MO243_DATAH)

/** \\brief  2E70, Message Object  Data Register Low */
#define CAN_MO243_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AE70u)

/** Alias (User Manual Name) for CAN_MO243_DATAL.
* To use register names with standard convension, please use CAN_MO243_DATAL.
*/
#define	CAN_MODATAL243	(CAN_MO243_DATAL)

/** \\brief  2E60, Message Object  Function Control Register */
#define CAN_MO243_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AE60u)

/** Alias (User Manual Name) for CAN_MO243_FCR.
* To use register names with standard convension, please use CAN_MO243_FCR.
*/
#define	CAN_MOFCR243	(CAN_MO243_FCR)

/** \\brief  2E64, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO243_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AE64u)

/** Alias (User Manual Name) for CAN_MO243_FGPR.
* To use register names with standard convension, please use CAN_MO243_FGPR.
*/
#define	CAN_MOFGPR243	(CAN_MO243_FGPR)

/** \\brief  2E68, Message Object  Interrupt Pointer Register */
#define CAN_MO243_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AE68u)

/** Alias (User Manual Name) for CAN_MO243_IPR.
* To use register names with standard convension, please use CAN_MO243_IPR.
*/
#define	CAN_MOIPR243	(CAN_MO243_IPR)

/** \\brief  2E8C, Message Object  Acceptance Mask Register */
#define CAN_MO244_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AE8Cu)

/** Alias (User Manual Name) for CAN_MO244_AMR.
* To use register names with standard convension, please use CAN_MO244_AMR.
*/
#define	CAN_MOAMR244	(CAN_MO244_AMR)

/** \\brief  2E98, Message Object  Arbitration Register */
#define CAN_MO244_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AE98u)

/** Alias (User Manual Name) for CAN_MO244_AR.
* To use register names with standard convension, please use CAN_MO244_AR.
*/
#define	CAN_MOAR244	(CAN_MO244_AR)

/** \\brief  2E9C, Message Object  Control Register */
#define CAN_MO244_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AE9Cu)

/** Alias (User Manual Name) for CAN_MO244_CTR_STAT.
* To use register names with standard convension, please use CAN_MO244_CTR_STAT.
*/
#define	CAN_MOSTAT244	(CAN_MO244_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO244_CTR_STAT.
* To use register names with standard convension, please use CAN_MO244_CTR_STAT.
*/
#define	CAN_MOCTR244	(CAN_MO244_CTR_STAT)

