summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_reg.h
/** \\brief  2EC0, Message Object  Function Control Register */
#define CAN_MO246_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AEC0u)

/** Alias (User Manual Name) for CAN_MO246_FCR.
* To use register names with standard convension, please use CAN_MO246_FCR.
*/
#define	CAN_MOFCR246	(CAN_MO246_FCR)

/** \\brief  2EC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO246_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AEC4u)

/** Alias (User Manual Name) for CAN_MO246_FGPR.
* To use register names with standard convension, please use CAN_MO246_FGPR.
*/
#define	CAN_MOFGPR246	(CAN_MO246_FGPR)

/** \\brief  2EC8, Message Object  Interrupt Pointer Register */
#define CAN_MO246_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AEC8u)

/** Alias (User Manual Name) for CAN_MO246_IPR.
* To use register names with standard convension, please use CAN_MO246_IPR.
*/
#define	CAN_MOIPR246	(CAN_MO246_IPR)

/** \\brief  2EEC, Message Object  Acceptance Mask Register */
#define CAN_MO247_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AEECu)

/** Alias (User Manual Name) for CAN_MO247_AMR.
* To use register names with standard convension, please use CAN_MO247_AMR.
*/
#define	CAN_MOAMR247	(CAN_MO247_AMR)

/** \\brief  2EF8, Message Object  Arbitration Register */
#define CAN_MO247_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AEF8u)

/** Alias (User Manual Name) for CAN_MO247_AR.
* To use register names with standard convension, please use CAN_MO247_AR.
*/
#define	CAN_MOAR247	(CAN_MO247_AR)

/** \\brief  2EFC, Message Object  Control Register */
#define CAN_MO247_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AEFCu)

/** Alias (User Manual Name) for CAN_MO247_CTR_STAT.
* To use register names with standard convension, please use CAN_MO247_CTR_STAT.
*/
#define	CAN_MOSTAT247	(CAN_MO247_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO247_CTR_STAT.
* To use register names with standard convension, please use CAN_MO247_CTR_STAT.
*/
#define	CAN_MOCTR247	(CAN_MO247_CTR_STAT)

/** \\brief  2EF4, Message Object  Data Register High */
#define CAN_MO247_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AEF4u)

/** Alias (User Manual Name) for CAN_MO247_DATAH.
* To use register names with standard convension, please use CAN_MO247_DATAH.
*/
#define	CAN_MODATAH247	(CAN_MO247_DATAH)

/** \\brief  2EF0, Message Object  Data Register Low */
#define CAN_MO247_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AEF0u)

/** Alias (User Manual Name) for CAN_MO247_DATAL.
* To use register names with standard convension, please use CAN_MO247_DATAL.
*/
#define	CAN_MODATAL247	(CAN_MO247_DATAL)

/** \\brief  2EE0, Message Object  Function Control Register */
#define CAN_MO247_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AEE0u)

/** Alias (User Manual Name) for CAN_MO247_FCR.
* To use register names with standard convension, please use CAN_MO247_FCR.
*/
#define	CAN_MOFCR247	(CAN_MO247_FCR)

/** \\brief  2EE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO247_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AEE4u)

/** Alias (User Manual Name) for CAN_MO247_FGPR.
* To use register names with standard convension, please use CAN_MO247_FGPR.
*/
#define	CAN_MOFGPR247	(CAN_MO247_FGPR)

/** \\brief  2EE8, Message Object  Interrupt Pointer Register */
#define CAN_MO247_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AEE8u)

/** Alias (User Manual Name) for CAN_MO247_IPR.
* To use register names with standard convension, please use CAN_MO247_IPR.
*/
#define	CAN_MOIPR247	(CAN_MO247_IPR)

/** \\brief  2F0C, Message Object  Acceptance Mask Register */
#define CAN_MO248_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AF0Cu)

/** Alias (User Manual Name) for CAN_MO248_AMR.
* To use register names with standard convension, please use CAN_MO248_AMR.
*/
#define	CAN_MOAMR248	(CAN_MO248_AMR)

/** \\brief  2F18, Message Object  Arbitration Register */
#define CAN_MO248_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AF18u)

/** Alias (User Manual Name) for CAN_MO248_AR.
* To use register names with standard convension, please use CAN_MO248_AR.
*/
#define	CAN_MOAR248	(CAN_MO248_AR)

/** \\brief  2F1C, Message Object  Control Register */
#define CAN_MO248_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AF1Cu)

/** Alias (User Manual Name) for CAN_MO248_CTR_STAT.
* To use register names with standard convension, please use CAN_MO248_CTR_STAT.
*/
#define	CAN_MOSTAT248	(CAN_MO248_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO248_CTR_STAT.
* To use register names with standard convension, please use CAN_MO248_CTR_STAT.
*/
#define	CAN_MOCTR248	(CAN_MO248_CTR_STAT)

/** \\brief  2F14, Message Object  Data Register High */
#define CAN_MO248_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AF14u)

/** Alias (User Manual Name) for CAN_MO248_DATAH.
* To use register names with standard convension, please use CAN_MO248_DATAH.
*/
#define	CAN_MODATAH248	(CAN_MO248_DATAH)

/** \\brief  2F10, Message Object  Data Register Low */
#define CAN_MO248_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AF10u)

/** Alias (User Manual Name) for CAN_MO248_DATAL.
* To use register names with standard convension, please use CAN_MO248_DATAL.
*/
#define	CAN_MODATAL248	(CAN_MO248_DATAL)

/** \\brief  2F00, Message Object  Function Control Register */
#define CAN_MO248_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AF00u)

/** Alias (User Manual Name) for CAN_MO248_FCR.
* To use register names with standard convension, please use CAN_MO248_FCR.
*/
#define	CAN_MOFCR248	(CAN_MO248_FCR)

/** \\brief  2F04, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO248_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AF04u)

/** Alias (User Manual Name) for CAN_MO248_FGPR.
* To use register names with standard convension, please use CAN_MO248_FGPR.
*/
#define	CAN_MOFGPR248	(CAN_MO248_FGPR)

/** \\brief  2F08, Message Object  Interrupt Pointer Register */
#define CAN_MO248_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AF08u)

/** Alias (User Manual Name) for CAN_MO248_IPR.
* To use register names with standard convension, please use CAN_MO248_IPR.
*/
#define	CAN_MOIPR248	(CAN_MO248_IPR)

/** \\brief  2F2C, Message Object  Acceptance Mask Register */
#define CAN_MO249_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AF2Cu)

/** Alias (User Manual Name) for CAN_MO249_AMR.
* To use register names with standard convension, please use CAN_MO249_AMR.
*/
#define	CAN_MOAMR249	(CAN_MO249_AMR)

/** \\brief  2F38, Message Object  Arbitration Register */
#define CAN_MO249_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AF38u)

/** Alias (User Manual Name) for CAN_MO249_AR.
* To use register names with standard convension, please use CAN_MO249_AR.
*/
#define	CAN_MOAR249	(CAN_MO249_AR)

/** \\brief  2F3C, Message Object  Control Register */
#define CAN_MO249_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AF3Cu)

/** Alias (User Manual Name) for CAN_MO249_CTR_STAT.
* To use register names with standard convension, please use CAN_MO249_CTR_STAT.
*/
#define	CAN_MOSTAT249	(CAN_MO249_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO249_CTR_STAT.
* To use register names with standard convension, please use CAN_MO249_CTR_STAT.
*/
#define	CAN_MOCTR249	(CAN_MO249_CTR_STAT)

