summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_reg.h
/** \\brief  2F34, Message Object  Data Register High */
#define CAN_MO249_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AF34u)

/** Alias (User Manual Name) for CAN_MO249_DATAH.
* To use register names with standard convension, please use CAN_MO249_DATAH.
*/
#define	CAN_MODATAH249	(CAN_MO249_DATAH)

/** \\brief  2F30, Message Object  Data Register Low */
#define CAN_MO249_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AF30u)

/** Alias (User Manual Name) for CAN_MO249_DATAL.
* To use register names with standard convension, please use CAN_MO249_DATAL.
*/
#define	CAN_MODATAL249	(CAN_MO249_DATAL)

/** \\brief  2F20, Message Object  Function Control Register */
#define CAN_MO249_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AF20u)

/** Alias (User Manual Name) for CAN_MO249_FCR.
* To use register names with standard convension, please use CAN_MO249_FCR.
*/
#define	CAN_MOFCR249	(CAN_MO249_FCR)

/** \\brief  2F24, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO249_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AF24u)

/** Alias (User Manual Name) for CAN_MO249_FGPR.
* To use register names with standard convension, please use CAN_MO249_FGPR.
*/
#define	CAN_MOFGPR249	(CAN_MO249_FGPR)

/** \\brief  2F28, Message Object  Interrupt Pointer Register */
#define CAN_MO249_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AF28u)

/** Alias (User Manual Name) for CAN_MO249_IPR.
* To use register names with standard convension, please use CAN_MO249_IPR.
*/
#define	CAN_MOIPR249	(CAN_MO249_IPR)

/** \\brief  130C, Message Object  Acceptance Mask Register */
#define CAN_MO24_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001930Cu)

/** Alias (User Manual Name) for CAN_MO24_AMR.
* To use register names with standard convension, please use CAN_MO24_AMR.
*/
#define	CAN_MOAMR24	(CAN_MO24_AMR)

/** \\brief  1318, Message Object  Arbitration Register */
#define CAN_MO24_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019318u)

/** Alias (User Manual Name) for CAN_MO24_AR.
* To use register names with standard convension, please use CAN_MO24_AR.
*/
#define	CAN_MOAR24	(CAN_MO24_AR)

/** \\brief  131C, Message Object  Control Register */
#define CAN_MO24_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001931Cu)

/** Alias (User Manual Name) for CAN_MO24_CTR_STAT.
* To use register names with standard convension, please use CAN_MO24_CTR_STAT.
*/
#define	CAN_MOSTAT24	(CAN_MO24_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO24_CTR_STAT.
* To use register names with standard convension, please use CAN_MO24_CTR_STAT.
*/
#define	CAN_MOCTR24	(CAN_MO24_CTR_STAT)

/** \\brief  1314, Message Object  Data Register High */
#define CAN_MO24_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019314u)

/** Alias (User Manual Name) for CAN_MO24_DATAH.
* To use register names with standard convension, please use CAN_MO24_DATAH.
*/
#define	CAN_MODATAH24	(CAN_MO24_DATAH)

/** \\brief  1310, Message Object  Data Register Low */
#define CAN_MO24_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019310u)

/** Alias (User Manual Name) for CAN_MO24_DATAL.
* To use register names with standard convension, please use CAN_MO24_DATAL.
*/
#define	CAN_MODATAL24	(CAN_MO24_DATAL)

/** \\brief  1300, Message Object  Function Control Register */
#define CAN_MO24_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019300u)

/** Alias (User Manual Name) for CAN_MO24_FCR.
* To use register names with standard convension, please use CAN_MO24_FCR.
*/
#define	CAN_MOFCR24	(CAN_MO24_FCR)

/** \\brief  1304, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO24_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019304u)

/** Alias (User Manual Name) for CAN_MO24_FGPR.
* To use register names with standard convension, please use CAN_MO24_FGPR.
*/
#define	CAN_MOFGPR24	(CAN_MO24_FGPR)

/** \\brief  1308, Message Object  Interrupt Pointer Register */
#define CAN_MO24_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019308u)

/** Alias (User Manual Name) for CAN_MO24_IPR.
* To use register names with standard convension, please use CAN_MO24_IPR.
*/
#define	CAN_MOIPR24	(CAN_MO24_IPR)

/** \\brief  2F4C, Message Object  Acceptance Mask Register */
#define CAN_MO250_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AF4Cu)

/** Alias (User Manual Name) for CAN_MO250_AMR.
* To use register names with standard convension, please use CAN_MO250_AMR.
*/
#define	CAN_MOAMR250	(CAN_MO250_AMR)

/** \\brief  2F58, Message Object  Arbitration Register */
#define CAN_MO250_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AF58u)

/** Alias (User Manual Name) for CAN_MO250_AR.
* To use register names with standard convension, please use CAN_MO250_AR.
*/
#define	CAN_MOAR250	(CAN_MO250_AR)

/** \\brief  2F5C, Message Object  Control Register */
#define CAN_MO250_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AF5Cu)

/** Alias (User Manual Name) for CAN_MO250_CTR_STAT.
* To use register names with standard convension, please use CAN_MO250_CTR_STAT.
*/
#define	CAN_MOCTR250	(CAN_MO250_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO250_CTR_STAT.
* To use register names with standard convension, please use CAN_MO250_CTR_STAT.
*/
#define	CAN_MOSTAT250	(CAN_MO250_CTR_STAT)

/** \\brief  2F54, Message Object  Data Register High */
#define CAN_MO250_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AF54u)

/** Alias (User Manual Name) for CAN_MO250_DATAH.
* To use register names with standard convension, please use CAN_MO250_DATAH.
*/
#define	CAN_MODATAH250	(CAN_MO250_DATAH)

/** \\brief  2F50, Message Object  Data Register Low */
#define CAN_MO250_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AF50u)

/** Alias (User Manual Name) for CAN_MO250_DATAL.
* To use register names with standard convension, please use CAN_MO250_DATAL.
*/
#define	CAN_MODATAL250	(CAN_MO250_DATAL)

/** \\brief  2F40, Message Object  Function Control Register */
#define CAN_MO250_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AF40u)

