summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO250_FCR.
* To use register names with standard convension, please use CAN_MO250_FCR.
*/
#define	CAN_MOFCR250	(CAN_MO250_FCR)

/** \\brief  2F44, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO250_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AF44u)

/** Alias (User Manual Name) for CAN_MO250_FGPR.
* To use register names with standard convension, please use CAN_MO250_FGPR.
*/
#define	CAN_MOFGPR250	(CAN_MO250_FGPR)

/** \\brief  2F48, Message Object  Interrupt Pointer Register */
#define CAN_MO250_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AF48u)

/** Alias (User Manual Name) for CAN_MO250_IPR.
* To use register names with standard convension, please use CAN_MO250_IPR.
*/
#define	CAN_MOIPR250	(CAN_MO250_IPR)

/** \\brief  2F6C, Message Object  Acceptance Mask Register */
#define CAN_MO251_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AF6Cu)

/** Alias (User Manual Name) for CAN_MO251_AMR.
* To use register names with standard convension, please use CAN_MO251_AMR.
*/
#define	CAN_MOAMR251	(CAN_MO251_AMR)

/** \\brief  2F78, Message Object  Arbitration Register */
#define CAN_MO251_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AF78u)

/** Alias (User Manual Name) for CAN_MO251_AR.
* To use register names with standard convension, please use CAN_MO251_AR.
*/
#define	CAN_MOAR251	(CAN_MO251_AR)

/** \\brief  2F7C, Message Object  Control Register */
#define CAN_MO251_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AF7Cu)

/** Alias (User Manual Name) for CAN_MO251_CTR_STAT.
* To use register names with standard convension, please use CAN_MO251_CTR_STAT.
*/
#define	CAN_MOCTR251	(CAN_MO251_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO251_CTR_STAT.
* To use register names with standard convension, please use CAN_MO251_CTR_STAT.
*/
#define	CAN_MOSTAT251	(CAN_MO251_CTR_STAT)

/** \\brief  2F74, Message Object  Data Register High */
#define CAN_MO251_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AF74u)

/** Alias (User Manual Name) for CAN_MO251_DATAH.
* To use register names with standard convension, please use CAN_MO251_DATAH.
*/
#define	CAN_MODATAH251	(CAN_MO251_DATAH)

/** \\brief  2F70, Message Object  Data Register Low */
#define CAN_MO251_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AF70u)

/** Alias (User Manual Name) for CAN_MO251_DATAL.
* To use register names with standard convension, please use CAN_MO251_DATAL.
*/
#define	CAN_MODATAL251	(CAN_MO251_DATAL)

/** \\brief  2F60, Message Object  Function Control Register */
#define CAN_MO251_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AF60u)

/** Alias (User Manual Name) for CAN_MO251_FCR.
* To use register names with standard convension, please use CAN_MO251_FCR.
*/
#define	CAN_MOFCR251	(CAN_MO251_FCR)

/** \\brief  2F64, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO251_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AF64u)

/** Alias (User Manual Name) for CAN_MO251_FGPR.
* To use register names with standard convension, please use CAN_MO251_FGPR.
*/
#define	CAN_MOFGPR251	(CAN_MO251_FGPR)

/** \\brief  2F68, Message Object  Interrupt Pointer Register */
#define CAN_MO251_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AF68u)

/** Alias (User Manual Name) for CAN_MO251_IPR.
* To use register names with standard convension, please use CAN_MO251_IPR.
*/
#define	CAN_MOIPR251	(CAN_MO251_IPR)

/** \\brief  2F8C, Message Object  Acceptance Mask Register */
#define CAN_MO252_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AF8Cu)

/** Alias (User Manual Name) for CAN_MO252_AMR.
* To use register names with standard convension, please use CAN_MO252_AMR.
*/
#define	CAN_MOAMR252	(CAN_MO252_AMR)

/** \\brief  2F98, Message Object  Arbitration Register */
#define CAN_MO252_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AF98u)

/** Alias (User Manual Name) for CAN_MO252_AR.
* To use register names with standard convension, please use CAN_MO252_AR.
*/
#define	CAN_MOAR252	(CAN_MO252_AR)

/** \\brief  2F9C, Message Object  Control Register */
#define CAN_MO252_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AF9Cu)

/** Alias (User Manual Name) for CAN_MO252_CTR_STAT.
* To use register names with standard convension, please use CAN_MO252_CTR_STAT.
*/
#define	CAN_MOCTR252	(CAN_MO252_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO252_CTR_STAT.
* To use register names with standard convension, please use CAN_MO252_CTR_STAT.
*/
#define	CAN_MOSTAT252	(CAN_MO252_CTR_STAT)

/** \\brief  2F94, Message Object  Data Register High */
#define CAN_MO252_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AF94u)

/** Alias (User Manual Name) for CAN_MO252_DATAH.
* To use register names with standard convension, please use CAN_MO252_DATAH.
*/
#define	CAN_MODATAH252	(CAN_MO252_DATAH)

/** \\brief  2F90, Message Object  Data Register Low */
#define CAN_MO252_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AF90u)

/** Alias (User Manual Name) for CAN_MO252_DATAL.
* To use register names with standard convension, please use CAN_MO252_DATAL.
*/
#define	CAN_MODATAL252	(CAN_MO252_DATAL)

/** \\brief  2F80, Message Object  Function Control Register */
#define CAN_MO252_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AF80u)

/** Alias (User Manual Name) for CAN_MO252_FCR.
* To use register names with standard convension, please use CAN_MO252_FCR.
*/
#define	CAN_MOFCR252	(CAN_MO252_FCR)

/** \\brief  2F84, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO252_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AF84u)

/** Alias (User Manual Name) for CAN_MO252_FGPR.
* To use register names with standard convension, please use CAN_MO252_FGPR.
*/
#define	CAN_MOFGPR252	(CAN_MO252_FGPR)

/** \\brief  2F88, Message Object  Interrupt Pointer Register */
#define CAN_MO252_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AF88u)

