summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_reg.h
/** Alias (User Manual Name) for CAN_MO252_IPR.
* To use register names with standard convension, please use CAN_MO252_IPR.
*/
#define	CAN_MOIPR252	(CAN_MO252_IPR)

/** \\brief  2FAC, Message Object  Acceptance Mask Register */
#define CAN_MO253_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AFACu)

/** Alias (User Manual Name) for CAN_MO253_AMR.
* To use register names with standard convension, please use CAN_MO253_AMR.
*/
#define	CAN_MOAMR253	(CAN_MO253_AMR)

/** \\brief  2FB8, Message Object  Arbitration Register */
#define CAN_MO253_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AFB8u)

/** Alias (User Manual Name) for CAN_MO253_AR.
* To use register names with standard convension, please use CAN_MO253_AR.
*/
#define	CAN_MOAR253	(CAN_MO253_AR)

/** \\brief  2FBC, Message Object  Control Register */
#define CAN_MO253_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AFBCu)

/** Alias (User Manual Name) for CAN_MO253_CTR_STAT.
* To use register names with standard convension, please use CAN_MO253_CTR_STAT.
*/
#define	CAN_MOCTR253	(CAN_MO253_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO253_CTR_STAT.
* To use register names with standard convension, please use CAN_MO253_CTR_STAT.
*/
#define	CAN_MOSTAT253	(CAN_MO253_CTR_STAT)

/** \\brief  2FB4, Message Object  Data Register High */
#define CAN_MO253_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AFB4u)

/** Alias (User Manual Name) for CAN_MO253_DATAH.
* To use register names with standard convension, please use CAN_MO253_DATAH.
*/
#define	CAN_MODATAH253	(CAN_MO253_DATAH)

/** \\brief  2FB0, Message Object  Data Register Low */
#define CAN_MO253_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AFB0u)

/** Alias (User Manual Name) for CAN_MO253_DATAL.
* To use register names with standard convension, please use CAN_MO253_DATAL.
*/
#define	CAN_MODATAL253	(CAN_MO253_DATAL)

/** \\brief  2FA0, Message Object  Function Control Register */
#define CAN_MO253_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AFA0u)

/** Alias (User Manual Name) for CAN_MO253_FCR.
* To use register names with standard convension, please use CAN_MO253_FCR.
*/
#define	CAN_MOFCR253	(CAN_MO253_FCR)

/** \\brief  2FA4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO253_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AFA4u)

/** Alias (User Manual Name) for CAN_MO253_FGPR.
* To use register names with standard convension, please use CAN_MO253_FGPR.
*/
#define	CAN_MOFGPR253	(CAN_MO253_FGPR)

/** \\brief  2FA8, Message Object  Interrupt Pointer Register */
#define CAN_MO253_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AFA8u)

/** Alias (User Manual Name) for CAN_MO253_IPR.
* To use register names with standard convension, please use CAN_MO253_IPR.
*/
#define	CAN_MOIPR253	(CAN_MO253_IPR)

/** \\brief  2FCC, Message Object  Acceptance Mask Register */
#define CAN_MO254_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AFCCu)

/** Alias (User Manual Name) for CAN_MO254_AMR.
* To use register names with standard convension, please use CAN_MO254_AMR.
*/
#define	CAN_MOAMR254	(CAN_MO254_AMR)

/** \\brief  2FD8, Message Object  Arbitration Register */
#define CAN_MO254_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AFD8u)

/** Alias (User Manual Name) for CAN_MO254_AR.
* To use register names with standard convension, please use CAN_MO254_AR.
*/
#define	CAN_MOAR254	(CAN_MO254_AR)

/** \\brief  2FDC, Message Object  Control Register */
#define CAN_MO254_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AFDCu)

/** Alias (User Manual Name) for CAN_MO254_CTR_STAT.
* To use register names with standard convension, please use CAN_MO254_CTR_STAT.
*/
#define	CAN_MOCTR254	(CAN_MO254_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO254_CTR_STAT.
* To use register names with standard convension, please use CAN_MO254_CTR_STAT.
*/
#define	CAN_MOSTAT254	(CAN_MO254_CTR_STAT)

/** \\brief  2FD4, Message Object  Data Register High */
#define CAN_MO254_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AFD4u)

/** Alias (User Manual Name) for CAN_MO254_DATAH.
* To use register names with standard convension, please use CAN_MO254_DATAH.
*/
#define	CAN_MODATAH254	(CAN_MO254_DATAH)

/** \\brief  2FD0, Message Object  Data Register Low */
#define CAN_MO254_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AFD0u)

/** Alias (User Manual Name) for CAN_MO254_DATAL.
* To use register names with standard convension, please use CAN_MO254_DATAL.
*/
#define	CAN_MODATAL254	(CAN_MO254_DATAL)

/** \\brief  2FC0, Message Object  Function Control Register */
#define CAN_MO254_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AFC0u)

/** Alias (User Manual Name) for CAN_MO254_FCR.
* To use register names with standard convension, please use CAN_MO254_FCR.
*/
#define	CAN_MOFCR254	(CAN_MO254_FCR)

/** \\brief  2FC4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO254_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AFC4u)

/** Alias (User Manual Name) for CAN_MO254_FGPR.
* To use register names with standard convension, please use CAN_MO254_FGPR.
*/
#define	CAN_MOFGPR254	(CAN_MO254_FGPR)

/** \\brief  2FC8, Message Object  Interrupt Pointer Register */
#define CAN_MO254_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AFC8u)

/** Alias (User Manual Name) for CAN_MO254_IPR.
* To use register names with standard convension, please use CAN_MO254_IPR.
*/
#define	CAN_MOIPR254	(CAN_MO254_IPR)

/** \\brief  2FEC, Message Object  Acceptance Mask Register */
#define CAN_MO255_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001AFECu)

/** Alias (User Manual Name) for CAN_MO255_AMR.
* To use register names with standard convension, please use CAN_MO255_AMR.
*/
#define	CAN_MOAMR255	(CAN_MO255_AMR)

/** \\brief  2FF8, Message Object  Arbitration Register */
#define CAN_MO255_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF001AFF8u)

/** Alias (User Manual Name) for CAN_MO255_AR.
* To use register names with standard convension, please use CAN_MO255_AR.
*/
#define	CAN_MOAR255	(CAN_MO255_AR)

