summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_reg.h
/** \\brief  2FFC, Message Object  Control Register */
#define CAN_MO255_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001AFFCu)

/** Alias (User Manual Name) for CAN_MO255_CTR_STAT.
* To use register names with standard convension, please use CAN_MO255_CTR_STAT.
*/
#define	CAN_MOCTR255	(CAN_MO255_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO255_CTR_STAT.
* To use register names with standard convension, please use CAN_MO255_CTR_STAT.
*/
#define	CAN_MOSTAT255	(CAN_MO255_CTR_STAT)

/** \\brief  2FF4, Message Object  Data Register High */
#define CAN_MO255_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF001AFF4u)

/** Alias (User Manual Name) for CAN_MO255_DATAH.
* To use register names with standard convension, please use CAN_MO255_DATAH.
*/
#define	CAN_MODATAH255	(CAN_MO255_DATAH)

/** \\brief  2FF0, Message Object  Data Register Low */
#define CAN_MO255_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF001AFF0u)

/** Alias (User Manual Name) for CAN_MO255_DATAL.
* To use register names with standard convension, please use CAN_MO255_DATAL.
*/
#define	CAN_MODATAL255	(CAN_MO255_DATAL)

/** \\brief  2FE0, Message Object  Function Control Register */
#define CAN_MO255_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF001AFE0u)

/** Alias (User Manual Name) for CAN_MO255_FCR.
* To use register names with standard convension, please use CAN_MO255_FCR.
*/
#define	CAN_MOFCR255	(CAN_MO255_FCR)

/** \\brief  2FE4, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO255_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF001AFE4u)

/** Alias (User Manual Name) for CAN_MO255_FGPR.
* To use register names with standard convension, please use CAN_MO255_FGPR.
*/
#define	CAN_MOFGPR255	(CAN_MO255_FGPR)

/** \\brief  2FE8, Message Object  Interrupt Pointer Register */
#define CAN_MO255_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF001AFE8u)

/** Alias (User Manual Name) for CAN_MO255_IPR.
* To use register names with standard convension, please use CAN_MO255_IPR.
*/
#define	CAN_MOIPR255	(CAN_MO255_IPR)

/** \\brief  132C, Message Object  Acceptance Mask Register */
#define CAN_MO25_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001932Cu)

/** Alias (User Manual Name) for CAN_MO25_AMR.
* To use register names with standard convension, please use CAN_MO25_AMR.
*/
#define	CAN_MOAMR25	(CAN_MO25_AMR)

/** \\brief  1338, Message Object  Arbitration Register */
#define CAN_MO25_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019338u)

/** Alias (User Manual Name) for CAN_MO25_AR.
* To use register names with standard convension, please use CAN_MO25_AR.
*/
#define	CAN_MOAR25	(CAN_MO25_AR)

/** \\brief  133C, Message Object  Control Register */
#define CAN_MO25_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001933Cu)

/** Alias (User Manual Name) for CAN_MO25_CTR_STAT.
* To use register names with standard convension, please use CAN_MO25_CTR_STAT.
*/
#define	CAN_MOSTAT25	(CAN_MO25_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO25_CTR_STAT.
* To use register names with standard convension, please use CAN_MO25_CTR_STAT.
*/
#define	CAN_MOCTR25	(CAN_MO25_CTR_STAT)

/** \\brief  1334, Message Object  Data Register High */
#define CAN_MO25_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019334u)

/** Alias (User Manual Name) for CAN_MO25_DATAH.
* To use register names with standard convension, please use CAN_MO25_DATAH.
*/
#define	CAN_MODATAH25	(CAN_MO25_DATAH)

/** \\brief  1330, Message Object  Data Register Low */
#define CAN_MO25_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019330u)

/** Alias (User Manual Name) for CAN_MO25_DATAL.
* To use register names with standard convension, please use CAN_MO25_DATAL.
*/
#define	CAN_MODATAL25	(CAN_MO25_DATAL)

/** \\brief  1320, Message Object  Function Control Register */
#define CAN_MO25_FCR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FCR*)0xF0019320u)

/** Alias (User Manual Name) for CAN_MO25_FCR.
* To use register names with standard convension, please use CAN_MO25_FCR.
*/
#define	CAN_MOFCR25	(CAN_MO25_FCR)

/** \\brief  1324, Message Object  FIFO/Gateway Pointer Register */
#define CAN_MO25_FGPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_FGPR*)0xF0019324u)

/** Alias (User Manual Name) for CAN_MO25_FGPR.
* To use register names with standard convension, please use CAN_MO25_FGPR.
*/
#define	CAN_MOFGPR25	(CAN_MO25_FGPR)

/** \\brief  1328, Message Object  Interrupt Pointer Register */
#define CAN_MO25_IPR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_IPR*)0xF0019328u)

/** Alias (User Manual Name) for CAN_MO25_IPR.
* To use register names with standard convension, please use CAN_MO25_IPR.
*/
#define	CAN_MOIPR25	(CAN_MO25_IPR)

/** \\brief  134C, Message Object  Acceptance Mask Register */
#define CAN_MO26_AMR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AMR*)0xF001934Cu)

/** Alias (User Manual Name) for CAN_MO26_AMR.
* To use register names with standard convension, please use CAN_MO26_AMR.
*/
#define	CAN_MOAMR26	(CAN_MO26_AMR)

/** \\brief  1358, Message Object  Arbitration Register */
#define CAN_MO26_AR /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_AR*)0xF0019358u)

/** Alias (User Manual Name) for CAN_MO26_AR.
* To use register names with standard convension, please use CAN_MO26_AR.
*/
#define	CAN_MOAR26	(CAN_MO26_AR)

/** \\brief  135C, Message Object  Control Register */
#define CAN_MO26_CTR_STAT /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_CTR_STAT*)0xF001935Cu)

/** Alias (User Manual Name) for CAN_MO26_CTR_STAT.
* To use register names with standard convension, please use CAN_MO26_CTR_STAT.
*/
#define	CAN_MOSTAT26	(CAN_MO26_CTR_STAT)

/** Alias (User Manual Name) for CAN_MO26_CTR_STAT.
* To use register names with standard convension, please use CAN_MO26_CTR_STAT.
*/
#define	CAN_MOCTR26	(CAN_MO26_CTR_STAT)

/** \\brief  1354, Message Object  Data Register High */
#define CAN_MO26_DATAH /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAH*)0xF0019354u)

/** Alias (User Manual Name) for CAN_MO26_DATAH.
* To use register names with standard convension, please use CAN_MO26_DATAH.
*/
#define	CAN_MODATAH26	(CAN_MO26_DATAH)

/** \\brief  1350, Message Object  Data Register Low */
#define CAN_MO26_DATAL /*lint --e(923)*/ (*(volatile Ifx_CAN_MO_DATAL*)0xF0019350u)

/** Alias (User Manual Name) for CAN_MO26_DATAL.
* To use register names with standard convension, please use CAN_MO26_DATAL.
*/
#define	CAN_MODATAL26	(CAN_MO26_DATAL)

